{"Date":"2022-02-10","Author":"Linh Nguyen","Body":"Not a good experience so far. the app has a lot of problems and have many creepy people who can freely add me and message me whenever they want.","Heading":"Not a good experience so far","Rating":2,"Location":"VN"}
{"Date":"2019-10-18","Author":"Daniel","Body":"I use whatsapp most days, well made and easy to use, I chat to most of my friends on it!","Heading":"Brilliant app","Rating":4,"Location":"GB"}
{"Date":"2020-08-16","Author":"Football HD","Body":"Very very cool application \nIt's easy and useful app \nWe can post more of stories and talking, chatting , calling with friends\nReally it's a fantastic app\nBut the problem is the quality voice is something bad \nBut it's a good app","Heading":"Very very cool application","Rating":5,"Location":"MA"}
{"Date":"2022-02-10","Author":"Marius B","Body":"I have been listened by WhatsApp while speaking with a friend about a certain subject and then saw lots of related ads on Facebook. I never searched the internet about that subject so I'm sure that it didn't came from a cookie policy but from WhatsApp listening to my conversations. I stopped using it and switched to a better service that respects privacy.","Heading":"Conversations are not actually private.","Rating":1,"Location":"GB"}
{"Date":"2022-12-31","Author":"Sandra","Body":"The WhatsApp support is a total pile of crap. They don’t read the responses and do not address the issue. Total waste of time.","Heading":"The WhatsApp support is a total pile of…","Rating":1,"Location":"AU"}
{"Date":"2019-06-08","Author":"Mai","Body":"Trust Pilot really need to let you give less than 1 star!\nAbsolutely rubbish app!\nWon't let me add a new contact and it seems that the only way to remove anyone from the contacts is to delete them from your phone!\nHow absolutely stupid is that!\nIf I wanted to delete contacts from my phone they would be deleted!\nReally bloody rubbish!\nAnd people all over the world give them complete access to their phone, contacts and all their details!\nYou'd think that with all the spying they do on your life they could atleast let you do something as simple as adding and removing contacts!\nOr is it because you don't want them removed WhatsApp?\nIf you can't do it properly then you shouldn't be in that business!!!!\nEither fix it for the people or get out!","Heading":"Absolutely bloody rubbish!","Rating":1,"Location":"GB"}
{"Date":"2024-05-02","Author":"Johann","Body":"Sound on WhatsApp desktop not working, all other apps sound works perfect. Send WhatsApp support an email asking for assistance and just got this reply.....\n\n##- WhatsApp Support -##\n\nHi,\n\nThanks for your message.\n\nUnfortunately, this issue is out of the scope of support that WhatsApp can provide.","Heading":"WhatsApp support is USELESS!!","Rating":1,"Location":"CZ"}
{"Date":"2023-04-06","Author":"michael wilkinson","Body":"Do not like the new look page use to be able to swipe right and reply to specific messages now cannot , let's go back to the way it was before this update .... annoying.","Heading":"Do not like the new look page","Rating":2,"Location":"GB"}
{"Date":"2024-04-01","Author":"Jamil Hassan","Body":"Best app for chatting and video call audio call and for WhatsApp group best social app ","Heading":"Best app for chatting and video call…","Rating":5,"Location":"PK"}
{"Date":"2020-12-03","Author":"Marino Villa","Body":"i communicate with all my friends on whats app and its very fun and nice way","Heading":"i communicate with all my friends on…","Rating":5,"Location":"IT"}
{"Date":"2021-06-11","Author":"Jonas","Body":"Switched to Signal because of their abusive privacy policies.","Heading":"Switched to Signal because of their…","Rating":1,"Location":"DE"}
{"Date":"2020-09-18","Author":"Julia","Body":"I downloaded WhatsApp to join a volunteer group.\nWe have one chat group where we’ve had a few discussions. We’ll go for a week or two without chatting at all, and then chat for maybe a day or so.\nA few days ago when we were chatting I received a video in a foreign language from someone I had never heard of. I asked the others on the chat if they had received it and they had not. \nApparently a person I never heard of was able to send me a video from another country with no explanation.\nI checked my WhatsApp privacy settings and they were all set to Everyone and automatic download. Apparently this made it possible for a total stranger to send a video that was automatically downloaded into my camera roll.\nThis is extremely careless of WhatsApp! Are they trying to facilitate viruses and stalking? I am so accustomed to programs having reasonable security settings, I never thought of checking them. I’m lucky there were no viruses in the video message, and I’ll never fully trust WhatsApp again.","Heading":"Change your privacy settings right away","Rating":2,"Location":"US"}
{"Date":"2024-02-07","Author":"Consumer","Body":"I tried to get help and support from WhatsApp to recover my WhatsApp chat from iCloud but they just don't bother to help! \n\nIf WhatsApp has feature to backup chat into iCloud protected by password then it must allow to recover forgotten password!!  WhatsApp support centre is a complete failure to help and they don't talk over the phone just email a link go through it , and its all useless!\nEven they asked some screenshots of the issue but still nothing they have done! I am at last attempt and if entered a wrong password then the data will be lost!! so disappointing and unprofessional services from WhatsApp","Heading":"Recover WhatsApp backup from icloud","Rating":1,"Location":"GB"}
{"Date":"2020-06-09","Author":"Zoi Pachis","Body":"Amazing app!\ni cant imagine my work and private life without it anymore\nSo useful","Heading":"Amazing app!","Rating":5,"Location":"GR"}
{"Date":"2023-07-31","Author":"Misbah Rashid Usman","Body":"No Doubt everyone likes to use this app and there services are Soo quick and fast ☺️💕.I really like it's","Heading":"No Doubt everyone likes to use this app…","Rating":4,"Location":"PK"}
{"Date":"2022-06-13","Author":"Sara Skinner","Body":"TOTALLY UNHAPPY WITH THEIR RESPONSE. SOMEBODY TOOK ONE OF MY PHOTOS AND CONTACTED FRIENDS\/RELATIVES TO REQUEST MONEY. THEY IMPERSONATED ME. WHAT DID WHATS APP DO? THEY SENT ME AUTOMATIC REPLIES AND THEN CLOSED MY CHAT","Heading":"TOTALLY UNHAPPY WITH THEIR RESPONSE","Rating":1,"Location":"KZ"}
{"Date":"2022-02-03","Author":"Gary","Body":"Terrible customer service, and behind the times application. If you're a new user do NOT go with WhatsApp, use telegram instead where the feature set is better. WhatsApp will do whatever they can to hold your chats hostage on an operating system and will not let you transfer across devices. Do not use. Also when you try to get advice from customer service, they use an automated chat to respond which never answers your actual question. I wish I hadn't used WhatsApp as now I have my chats from loved ones stuck there, and unable to move them to a new £1300 iPhone 13 pro that's been sat in the cupboard since November last year waiting for an update on chat migrations. Their service and features, as well as customer service, is not good enough.","Heading":"Terrible customer service","Rating":1,"Location":"GB"}
{"Date":"2019-09-23","Author":"Natasha Addicted to Art","Body":"People can add you to groups without permission and then blocked contacts can interact with you. They should still be blocked in the groups or you should be able to refuse to be added to a group","Heading":"Whatsapp - People can add you to groups without…","Rating":1,"Location":"ZA"}
{"Date":"2023-01-01","Author":"Disappointed customer","Body":"Poor customer service!!.. \nBig issues or small all felt by computers with a standard reply !.. they can not solve complex problems as it seems there is no real technical team !! \nMy what’s app has not backed up since 2021 and I have reported this so many times \nNow I need a new phone nothing will get transferred \nMost are just casual chats so not bothered  but there are things that I need to keep !! \nI just keep getting the same message to solve problems \nThen they make it difficult to post a revive like this on their site 😣","Heading":"Poor customer service!!.","Rating":2,"Location":"GB"}
{"Date":"2023-06-10","Author":"Mahsa Aryaei Parsa","Body":"Lots of features missing\nPleased dont show the deleted messages","Heading":"Lots of features missing","Rating":3,"Location":"GB"}
{"Date":"2023-12-03","Author":"Veeru Sonkar","Body":"Nonononono","Heading":"9315068468","Rating":5,"Location":"IN"}
{"Date":"2020-08-29","Author":"Grace Petrie","Body":"I was asked to use this app as a means of communication with a group of friends. I went to check for new messages only to be told that my account\/ phone number is invalid and therefore blocked. I tried to go through their support line. I was told I was in violation of their terms of agreement and they have multiple complaints about my account. I only have their app on my kindle which I linked to my phone. I truly have done nothing wrong and am very disappointed that I can't use it on my device. I don't want it on my phone. I have used my mobile Windows devices and my phone number for other web-based call apps for several years. \nI know that I have not violated any of their \"Terms of agreement\" and am disappointed on how disgracefully they have responded to my request to unblock my very valid phone number.","Heading":"I was asked to use this app as a means…","Rating":1,"Location":"US"}
{"Date":"2023-03-21","Author":"haissam mahmoud","Body":"I hope it closes.","Heading":"I hope it closes.","Rating":1,"Location":"TR"}
{"Date":"2022-02-24","Author":"Dave A","Body":"I remain to be convinced of privacy and the desktop version sucks big time.\n\nI've gone over to mewe.com\nNo commie censors there!","Heading":"Privacy…?","Rating":2,"Location":"GB"}
{"Date":"2022-03-09","Author":"Debra Green","Body":"WhatsApp is a disgrace. We have porn on our group and even the Admin can’t remove it. Lots of people have left. Their complaints procedure is a joke. You just get a copy and pasted general message not addressing your complaint at all.","Heading":"WhatsApp is a disgrace","Rating":1,"Location":"GB"}
{"Date":"2023-06-14","Author":"hossam fathi","Body":"I have been communicating with support for the past couple of days, they're always misunderstanding my issue constantly, sometimes they answer a question that isn't vaguely similar to the one I asked. It's so frustrating.","Heading":"I have been communicating with support for 3 times every time they close my case. this is unfair","Rating":1,"Location":"EG"}
{"Date":"2023-02-27","Author":"Piyush Singh","Body":"Too bad i can even give negative star rating if there is an option\n\nTheir stupid customer support is horrible i asked many time the same thing they are not helping me at all tried to mail them tried to contact them on whatsapp all went just upseen these stupid people and meta players just want your data and they don't want to provide any support","Heading":"They must be shut down","Rating":1,"Location":"IN"}
{"Date":"2023-07-15","Author":"Aatif Samejo","Body":"The app is literally praise worthy as it is easy and fast .","Heading":"The app is literally praise worthy as…","Rating":5,"Location":"PK"}
{"Date":"2023-06-30","Author":"DarioG","Body":"Changed phone, deinstalled WA, reinstalled on new phone with old SIM... code received as usual BUT now it wants a PIN, a 2-way authentication... which I never provided - and I never provided an email as well.\nEven funnier, the message says \"if you did not set up an email and pin, in 3 days you will be able to skip this request\"\n...\n\nwhat... the hell... is going on... in your seriously damaged brains?","Heading":"Changed phone, it's asking for non-existent email","Rating":2,"Location":"GB"}
{"Date":"2021-01-17","Author":"E K","Body":"Owned by Fakebook. There are better and safer communication platforms. Signal and telegram.","Heading":"Owned by Fakebook","Rating":1,"Location":"US"}
{"Date":"2021-06-13","Author":"Steve","Body":"Customer service is the worst I have come across in a long time, I have an issue with notifications not getting pushed through after updating legion phone to android 11 1st attempt to contact who ever it was said to re-report the issue so it would pass to another customer service drone 2nd attempt got asked to video and screen shot the issue describe problem send logs I did this multiple times multiple videos multiple screen shots took screen recordings of settings and the issue in real time I added everything in detail and sent everything they asked for to be told \"we don't have enough information\" can you send the exact information I've already sent them. They clearly are not interested in helping there customers whatso ever I have now been ignored for the last week I've sent an email each day asking for a response and a supvisor to contact me back or to give me contact details to make a formal complaint against them still get blanked. They are shockingly poor I've now had enough and getting everyone I know to swap to signal I'd advise everyone else to do the same. I've also posted a lengthy post to their Facebook page through a friends account. I refuse to sign up with Facebook but WhatsApp need publicly shaming for their abismal customer service I will continue to send email each day until I get help or an answer\nMAIN THING AVOID AVOID AVOID","Heading":"Customer service is the worst I have…","Rating":1,"Location":"GB"}
{"Date":"2020-12-12","Author":"Jonathan Roberts","Body":"Very disappointed with 2 pin verification. Don't understand why they've made it so difficult to reset. Had new phone. Forgot pin. Tried resetting through email. No joy. What a load of rubbish. Got to wait 6 days to try and reset. They having a laugh. All my other apps no problems.","Heading":"Very disappointed with 2 pin…","Rating":1,"Location":"GB"}
{"Date":"2021-02-27","Author":"victor sqlhost","Body":"Support sucks, my WhatsApp account got hacked and have sent several tickets to WhatsApp official support email, totally irrelevant reply that cannot solve the problem, has been more than one week now and the problem remains unsolved.","Heading":"Support sucks","Rating":1,"Location":"HK"}
{"Date":"2019-01-21","Author":"Powerful spells caster","Body":"Powerful spells caster, psychic reading, palmistry, money spells, lotto spells lottery spells, love spells\n*Protection Spells *Remove Negative Energy *Removing Curse Spells. *Spiritual Cleansing, *Financial spells *Spiritual Healing \n*Voodoo Spells, *Good Luck Charm *Powerful Magical Love Spells, \n*Break Up Spells *Gay Love Spells \nThe Spell To Defeat Your Rival, Fertility Spells, Divorce Spells, Marriage Spells, \nchange your love situation contact us for help about your husband or ex-boyfriend, \nBind Us Together, Change Your Love situation\n+27633429794\nLost love spells caster in Johannesburg","Heading":"Powerful spells caster","Rating":5,"Location":"ZA"}
{"Date":"2023-09-21","Author":"MIGUEL","Body":"It is, in fact, their assistance. \nRead questions infrequently. \nMerely making standard answers of waiting where they discourage users.","Heading":"Assistance","Rating":1,"Location":"FR"}
{"Date":"2024-04-23","Author":"Ralf Beswick","Body":"The actual service is great mostly. However, if you have any problems, which you likely will eventually, there is zero customer support. The only help they seem to offer is an online Faq page. No phone number, no email, just an in-app automated chat which will always end up directing you to the faq page, even if you specifically tell them you problem isn't solved there.","Heading":"Non-existient customer support.","Rating":2,"Location":"GB"}
{"Date":"2018-09-30","Author":"Karla | EpicMusic Ltd","Body":"really easy to use and very good features. Especially enjoy using the 'whatsapp web' feature which is super easy.","Heading":"really easy to use and very good…","Rating":5,"Location":"US"}
{"Date":"2023-08-05","Author":"Miss NJ","Body":"New layout is naff . It was better before & easier   Why change it when it was fine","Heading":"New layout is naff","Rating":2,"Location":"GB"}
{"Date":"2023-07-22","Author":"Client","Body":"Completely useless customer support. Would be a lot better if they don’t offer it as it just frustrates more the users.\nKeep suggesting unrelated fix suggestions and closing the case where the problem was very clearly described in the support request and it is evident that no human is reading it…\n\nOne of the ticket numbers for reference in case anyone from whatsup cares: 1205117500162032\n0 stars for support","Heading":"Useless customer support","Rating":1,"Location":"BE"}
{"Date":"2023-05-25","Author":"Chloe Heenan","Body":"Even giving 1 star is a push. \nPossibly the most infuriating customer service I have experienced. \nIt is a broken bot that does absolutely nothing to help or answer the question being asked. \nYou would think this platform would have better service.","Heading":"Even giving 1 star is a push","Rating":1,"Location":"NL"}
{"Date":"2018-02-08","Author":"Michael Lie","Body":"the customer service did not even bother to read the problems i have in using the app, it immediately give me an automated message and direct me to the faqs, \n\nGood work there, sure, keep it up, just continue on assuming all your customers are idiot that can't even read and check the FAQS","Heading":"the customer service did not even …","Rating":1,"Location":"ID"}
{"Date":"2021-05-01","Author":"Andrew Stark","Body":"Cant make call\nCant make a video call\nCant open the PC app\nCant use the web version\nCant share messages\nAll messages removed everywhere when you reinstall this crap on any device. Whole data wipe.\n\nThis app is a piece of sh**, Telegram is 100000% better.","Heading":"Best crap app ever","Rating":1,"Location":"UA"}
{"Date":"2023-04-26","Author":"Rachel","Body":"Same as others - I’m disgusted with them actually but reliant on the app","Heading":"Same as others","Rating":1,"Location":"GB"}
{"Date":"2021-04-08","Author":"Giacomo","Body":"It is unacceptable that there are no iPad and no Apple Watch apps. It is the number one messaging app in the world! come on","Heading":"No iPad and no Apple Watch apps","Rating":1,"Location":"IT"}
{"Date":"2014-03-27","Author":"Tony Johnson","Body":"It's a part of life of many people now, including me. The best way to send pictures, videos, emoticons etc. to your family or friends. \r\nThanks for making this possible.","Heading":"part of life!","Rating":5,"Location":"AT"}
{"Date":"2017-09-13","Author":"Klahan Kulap","Body":"Awesome app. Great way to keep in touch with your real friends. Only problem is that it can take a large portion of your day!","Heading":"Awesome app","Rating":5,"Location":"GB"}
{"Date":"2024-01-20","Author":"Afshii","Body":"I m just missing one thing in android u cant listen the voice msg if you are out of the whatsapp box. This function has iphone and its really good because sometime u read the msgs of someone and u can reply them whitout coming online, but u have to go online to listen the voice msg thats a minus point of the android. They should change this funtion it would be very nice.","Heading":"Missing voice msg funtion","Rating":4,"Location":"NL"}
{"Date":"2020-07-10","Author":"Alexis P.","Body":"I like it. It's easy-to-use, has a bunch of cool features like GIFs. I like that I can star messages and go back to them when needed. The quality of calls isn't always ideal, but it could be my provider's fault. But I still prefer WhatsApp over any other messenger.","Heading":"It's wonderful","Rating":5,"Location":"GB"}
{"Date":"2018-02-13","Author":"Roopam Darshan Sharma","Body":"Down right now\nCan u please do something","Heading":"Down right now","Rating":3,"Location":"IN"}
{"Date":"2018-03-31","Author":"Shelby ","Body":"Truly a frustrating and out dated application. Stop tethering this app to our phone numbers, and get a team of customer service representatives that are actually helpful. Honestly so disgusted by them.","Heading":"Truly a frustrating and out dated…","Rating":1,"Location":"US"}
{"Date":"2021-02-17","Author":"Syed Rizvi","Body":"Since I'am using this application it's very easy to connect with my family, friend and office colleges. voice and video calling facility in application is one of the best features. Through my Status i can share my stories or place I visit and it appears only for 24 hours. Group creation is one feature which help you to build your contact for business.\nonly group members limit is one issue that by may consider to improve.","Heading":"Best Application of Communication","Rating":5,"Location":"PK"}
{"Date":"2020-11-24","Author":"Franzi S.","Body":"I don't really understand the negative comments about the app to be honest. I only ever had good experiences with it and I especially like that I can use the desktop app, so I don't have to always grab my phone when I get a message","Heading":"I don't really understand the negative reviews","Rating":5,"Location":"DE"}
{"Date":"2021-07-14","Author":"NFA","Body":"Dictator censorship","Heading":"Dictator censorship","Rating":1,"Location":"BE"}
{"Date":"2023-02-10","Author":"Jamie edwards","Body":"Why is it not compatible with iPad 7.","Heading":"Not available on iPad","Rating":1,"Location":"GB"}
{"Date":"2024-05-13","Author":"R E Broadley","Body":"Closed my account without warning claiming i was spamming which was not true whatsoever. \n\nLoat all access to chats and chat history. Doesn't let my contacts know my account is closed so it just looks like I am ignoring everyone now.","Heading":"Closed my account without warning…","Rating":1,"Location":"GB"}
{"Date":"2022-11-18","Author":"Oti Onwukah","Body":"After updating my WhatsApp, once every week, the app tells me that i am on a temporary ban from using whatsapp for a minimum of 6-8 hours which can be very frustrating. Can you fix this issue. This morning i have been in a gym and hardly used the app, but now it has gone into a temporary ban mode again. This app is becoming rubbish to say the least. Kindly fix this or go back to previous stable versions. To make matters worst the C. Service never replies back. Just happened again barely 24 hours and it is now happening every day. You can check my account to see what i am complaining about.","Heading":"Worst customer services in the world","Rating":1,"Location":"NG"}
{"Date":"2023-08-13","Author":"Clyde's Mum","Body":"It’s a complete waste of time contacting their “support” centre. It is clearly staffed by a poorly programmed computer who latches on to one word in your question and provides a response that has no relevance at all to your problem. Truly abysmal customer service.","Heading":"(Non) Support Centre…","Rating":1,"Location":"GB"}
{"Date":"2022-07-09","Author":"Guest","Body":"The worst ever support that I have ever received.  They are totally unaware of product, issues and how to troubleshoot.  Bunch of loosers.","Heading":"The worst ever support that I have ever…","Rating":1,"Location":"US"}
{"Date":"2021-10-09","Author":"janarthani# Krishnan","Body":"DEAR Whatsapp,\nI've been using whatsapp for many years. It's really an easy way of communication. Also I love all the features of Whatsapp. But we couldn't update our status in the web app(desktop whatsapp).Also there are many limited features in desktop whatsapp. Anyways I enjoy texting in whatsapp.","Heading":"DEAR Whatsapp,","Rating":4,"Location":"LK"}
{"Date":"2020-01-12","Author":"Moulya shree","Body":"Whatsapp features are updating well,, i just have one simple updation request that,it would seems better if there is a search option in status views.(it's lil handy for those who have more contacts).\nHope u consider my feedback.\nThank u","Heading":"Updation request","Rating":4,"Location":"IN"}
{"Date":"2018-10-28","Author":"kemal ","Body":"WhatsApp is good because it allowed me to find a variety of different topics and conversations that I could talk to randomly people on.","Heading":"WhatsApp is good because it allowed me…","Rating":4,"Location":"US"}
{"Date":"2020-09-21","Author":"Birgit March","Body":"uninvited  messages from unknown sources. It also keeps crashing continuously during the call. This never used to happen. I loved whatsapp but I may have to switch to another app taking my friends and family with me.","Heading":"uninvited  messages from unknown…","Rating":2,"Location":"DE"}
{"Date":"2022-05-12","Author":"Mindy","Body":"Appalled by how they deal with THE PROBLEMS THEY CAUSED US USERS! My dad's account got banned for apparently \"violating the terms\" when he did not do anything. First his Facebook account gets hacked and the next day his WhatsApp got banned. Isn't it possible that this is the hacker's doing? Ok fine if you do not want to reactivate the number, but what I asked was to remove the banned number from all the group chats as my dad is going to cancel his phone line and there might be a chance someone else gets that number in my country. First I get 3 responses that looked like a template WHICH ARE NOT RELATED TO MY QUERY, then finally I get a response that says \"Unfortunately responses to this email thread will not be responded\" \n\nJUST WOW. Shocked that this is how a huge and reputable company like WhatsApp handles this.","Heading":"Appalled by how they deal with THE…","Rating":1,"Location":"SG"}
{"Date":"2020-11-30","Author":"Rob M","Body":"Great app , does exactly what it says","Heading":"Great app","Rating":5,"Location":"GB"}
{"Date":"2023-10-16","Author":"Aniruddha","Body":"The tracks to use this app is insane.\nThe way of app works in background like never done by  any other apps.","Heading":"WhatsApp is in the wrong hand called Meta.","Rating":1,"Location":"IN"}
{"Date":"2022-08-19","Author":"Rockin' Johnny","Body":"When its installed after a lot of configuration its fine works a treat especially for sending photos otherwise every time it updates its a big re configuration process which relies on having a phone if your installing it on a PC. Really its too much of a hasstle every time the PC version needs to update which it does without telling you first. A nuisance avoid it if your planning on using it for the PC.","Heading":"When its installed after a lot of…","Rating":2,"Location":"GB"}
{"Date":"2018-07-20","Author":"Diego Riccio","Body":"I love this app and I would recommend it to anyone.","Heading":"I love this app and I would recommend…","Rating":5,"Location":"CH"}
{"Date":"2024-01-06","Author":"Mian Behramand","Body":"WhatsApp, once a trusted app with millions of users, has lost my trust. I believe that if someone blocks me or reports my number, I should have the right to defend myself. Without any warning, they forced me to change my 8-year-old number. I urge everyone to support me in calling on WhatsApp management to review their policies and help me recover my old number. Let's also advocate for a policy addressing individuals who misuse blocking for personal reasons. If someone wrongly blocks your number, there should be an appeal process to hold them accountable.\n923340350335","Heading":"WhatsApp support haters those who want to block your whatsapp number","Rating":1,"Location":"PK"}
{"Date":"2019-09-04","Author":"Faisal Hassan","Body":"Whats App operating is great. But it still need some changes like change in its imoji and graphics. \nIt need a special feature that show notification of birthday of every friends on status, whom added his or her number and provided info of his birthday.","Heading":"Whats App operating is great","Rating":4,"Location":"IN"}
{"Date":"2023-09-11","Author":"A. S. R.","Body":"THROUGH THE DECADE THEY HAVE TORTURED THE GENERAL PUBLIC IN EVERY WAY THEY CAN.","Heading":"THE ABSOLUTE WORST APP","Rating":1,"Location":"IN"}
{"Date":"2020-06-19","Author":"Dimitar Kamenov","Body":"amazing app, very user friendly, using it everyday!","Heading":"amazing app","Rating":5,"Location":"BG"}
{"Date":"2023-07-16","Author":"M mahdem","Body":"Very good messenger app with secure updates all the time","Heading":"Very good messenger app with secure…","Rating":5,"Location":"BH"}
{"Date":"2023-02-22","Author":"Sujon Kumar Roy","Body":"Whatsapp is the world's most popular messaging app, and it is easy to see why. It offers a comprehensive, user-friendly interface, wide-ranging features, and excellent security. The app allows users to create groups, share photos, videos, and documents, and make audio and video calls. It also supports end-to-end encryption, which ensures that only the sender and recipient can view the messages. Whatsapp is a powerful and essential tool for individuals, families, businesses, and organizations, and it can be used on both Android and iOS devices. With a host of features and a reliable security system, Whatsapp is a must-have communication app!","Heading":"Whatsapp: A Must-Have Communication App","Rating":5,"Location":"BD"}
{"Date":"2024-01-26","Author":"Flávio Pereira","Body":"It needs love and more help in ideas for development. It's a problem to be a company by Meta but the development is a key for success","Heading":"It needs love and more help in ideas…","Rating":4,"Location":"PT"}
{"Date":"2016-03-26","Author":"DonnaK","Body":"Really great application. You can share your videos, photos, music and chat with people on Iphone and Android! Registration is the best in this app- you have just connect it to your phone number. It's awesonme, bcuz all your friends that have installed this app will be in your friendlist in whatsapp!","Heading":"Really great app!","Rating":4,"Location":"US"}
{"Date":"2021-10-17","Author":"Mitsue","Body":"I liked WA.\nUnfortunately too many scammers use WA.\nNow I am very sceptical of anyone wanting to contact me via WA.\nSad...because WA was a tool I used to communicate with my family overseas.","Heading":"I liked WA.","Rating":3,"Location":"AU"}
{"Date":"2023-07-24","Author":"Faiz Faiz","Body":"Whatsapp is an app where we can put our video status, we can talk to people in video call by using Air is very good app.","Heading":"Whatsapp is an app where we can put our…","Rating":4,"Location":"PK"}
{"Date":"2020-01-28","Author":"Gilles Pelletier","Body":"Hello !  Be very careful with them.  Especially if you change your credit card number between the first booking and the time they take the second payment !!!  Have I made a reservation in Jaisalmer 5 months in advance?  three days before my arrival!  !!  I may have written to them, but I never received a response!  !!","Heading":"Be very careful !!!!!!","Rating":1,"Location":"IN"}
{"Date":"2021-10-21","Author":"Joe B.","Body":"In my experience with being lead to use Whatsapp and Google messaging app,  has been people representing females that are found to be actually other people using a picture of another person. \n\nOnce there they begin to sweet talk and seek money, gift cards, claim they are orphans and live and take care of \"granny\", other family member etc, etc. With a host of reasons to be needing financial assistance\n\nThey are very persistent and manipulative.","Heading":"In my experience with being lead to use…","Rating":1,"Location":"US"}
{"Date":"2023-09-08","Author":"Mahnoor","Body":"Its good to use and very usefull to contacting to each other.","Heading":"Its good to use and very usefull to…","Rating":5,"Location":"PK"}
{"Date":"2020-07-04","Author":"Vinay Singh","Body":"etrolley.weebly.com","Heading":"etrolley.weebly.com","Rating":5,"Location":"IN"}
{"Date":"2020-04-24","Author":"manu jupanu","Body":"2 years ago i made a whatsapp group and from 1 week by mistake i choice to leave the group..randomly whatsapp put someone else administrator on my group and that guy mess it on my group..i was call whatsapp customer to put me back on the group or to delete it but they said cant do nothing..how is possible the group who was made it by me, to not have control it and customer service are rubbish,they send me lies in emails..STAY AWAY FROM WHATSAPP AND FACEBOOK ..!","Heading":"2 years ago i made a whatsapp group and…","Rating":1,"Location":"GB"}
{"Date":"2021-05-09","Author":"Chetan Bhasin","Body":"If you had asked me two years ago, I would probably have given it 5 stars, but WhatsApp has been doing pretty poorly, specially since it was acquired by Facebook.\nYou can set status, put up stories, but you still don't have a desktop client. You can't make audio\/video calls from the web-version or even use the web version standalone without your phone being connected to the internet.\nThere is also no application for Apple Watch. I also can't use it with my iPad and iPhone in parallel.\nI switched to Signal, which offers all but Apple Watch feature, and I'm definitely not turning back to WhatsApp.\nAside from that, I personally find the latest privacy concerns pretty alarming for an application.","Heading":"Not nearly as good as it could have been","Rating":1,"Location":"DE"}
{"Date":"2019-09-28","Author":"Udhesh Pradesh","Body":"Why do you keep banning the GB version? It does not make sense at all","Heading":"Why do you keep banning the GB version","Rating":3,"Location":"KE"}
{"Date":"2022-11-28","Author":"paul","Body":"Why don't they put a translate button in the app???? Right next to every message.","Heading":"Why don't they put a translate button…","Rating":1,"Location":"US"}
{"Date":"2019-05-05","Author":"Mo Atul","Body":"A good app that has promoted effective communication. Its features of status, real time videos and delete options are great. Bingos!","Heading":"A good app that has promoted effective…","Rating":4,"Location":"TZ"}
{"Date":"2023-09-17","Author":"Fifi May","Body":"Did like this but not now it's owned by Facebook% Meta and you know that thyev gone against the buying contract of keeping all our data encrypted private","Heading":"Did like this but not now it's owned by…","Rating":3,"Location":"GB"}
{"Date":"2021-01-30","Author":"Gem Gem","Body":"What's app is great.\nWhat is a major design flaw is that 'block' and 'block and report' are next to each other. They need to be seperated! If you 'block and report' an unsaved number it then disappears!!  And you can't undo it easily! THIS NEEDS TO BE SORTED OUT! I'm not the only one who has been having issues with this!","Heading":"Block buttons need to be seperated","Rating":3,"Location":"GB"}
{"Date":"2018-10-21","Author":"Frank","Body":"Why in the world did they change the interface to flip the camera?","Heading":"Why in the world did they change the…","Rating":2,"Location":"US"}
{"Date":"2021-11-14","Author":"Sange","Body":"Its not safe but what can we do its mode of msging here","Heading":"Its not safe but what can we do its…","Rating":3,"Location":"IN"}
{"Date":"2022-04-16","Author":"SM","Body":"Rubbish customer care. \nThey don’t even read our queries before sending a response. They just have some general answers which they sent to all queries . I had  sent a query about having a problem with the media links and docs. Basically when I open the docs in a chat, it display a list of all docs sent and received from various chats rather than showing only the docs exchanged in that particular chat. \nAnd for this query I got a response from the customer care about how to have a good network connection which was almost a page long.  Insane ! \nI don’t have any connections issues and I haven’t  mentioned anything about it as well.  As a minimum they should at least read the query before sending a response. Never expected such low quality customer service from WhatsApp.","Heading":"Rubbish customer care","Rating":1,"Location":"GB"}
{"Date":"2021-04-18","Author":"R Malka","Body":"Beware people!!So pitty . A scam company they reduced the quality to send up to 5 items . Send you update don’t make any update !!","Heading":"Beware people!!So pitty  became terrible","Rating":1,"Location":"US"}
{"Date":"2016-08-07","Author":"Simon","Body":"I use a Blackberry phone because it is the only reliable smartphone with a keyboard and as a disabled person I am unable to use touchscreens.  I also use Whatsapp to stay in touch with my friends and my carers and healthcare providers.  As such Whatsapp provides me with a life saving service.\n\nI have been dismayed that Whatsapp are ending the Blackberry service and I have now messaged them FOUR times to seek advise on what keyboard phone I can use for Whatsapp in future but have received no reply whatsoever. I have even emailed their Press Office but again no reply.\n\nIt is clear that now Facebook have got hold of Whatsapp that they no longer care about customers and especially those like me who are disabled and rely totally on our phones.\n\nCan someone somewhere please help me and tell me what keyboard driven phone I can use in the future.\n\nSimon","Heading":"Whatsapp discriminate against disabled customers","Rating":1,"Location":"GB"}
{"Date":"2021-09-01","Author":"My Name Is Daniel","Body":"WhatsApp is better than Skype. A little bit problem is buffering during the call but is okay. At least I hope Mark Zuckergabbage does not mess up this app.","Heading":"WhatsApp Is Okay","Rating":4,"Location":"GB"}
{"Date":"2019-09-22","Author":"Penina Kitae","Body":"WhatsApp is super cool when it comes to communication it got you covered.\nIt has interesting features good emojis that enable you to communicate your emotions","Heading":"WhatsApp is super cool when it comes to…","Rating":4,"Location":"KE"}
{"Date":"2020-12-27","Author":"Ladybug ","Body":"This app is only good for messaging. Video calls even voice calls are always having issues. If you uninstall you have to wait like days before it allows you to reinstall. Least ive had to wait was 49hrs. Smdh. It doesn't allow you to share your background chat wallpaper when sending message to the other person it only shows up on your side.","Heading":"This app is only good for messaging","Rating":1,"Location":"US"}
{"Date":"2023-10-12","Author":"Zaliya Dayankrah","Body":"WhatsApp has really made my life easier when it comes to talking to my family back home. It helps me texts, audio recordings, audio and video call them easily and when ever I want","Heading":"A must have App","Rating":5,"Location":"US"}
{"Date":"2023-09-25","Author":"Gazza A","Body":"New update is terrible! Bring back the old version please!! Might just find another app to chat on! So many people I know think the same. Need to find new better app!","Heading":"New update is terrible","Rating":1,"Location":"GB"}
{"Date":"2022-01-22","Author":"Bethany Pease","Body":"it was an avarage messaging app untill my phone broke, I decided to go on whatsapp web. i could have confirmed through email account or something but to log on to whatsapp web you need your phone to log on even after looking for an alternative. \nhonestly pretty crap app","Heading":"it was an avarage messaging app untill.","Rating":1,"Location":"GB"}
{"Date":"2021-11-04","Author":"Heidi Rourke","Body":"I think they are rude intrusive\nThey are scam\nPeople ask you for money when you don't know them\nThen they sometimes scam your friends group\nHeidi","Heading":"I think they are rude intrusive","Rating":1,"Location":"US"}
{"Date":"2023-04-29","Author":"ADEEL AHMED","Body":"Whatsapp banned my 3 mobile phone numbers without any violation for Whatsapp policies and now they are not replying.","Heading":"Whatsapp banned my 3 mobile phone…","Rating":1,"Location":"PK"}
{"Date":"2020-03-12","Author":"Aman Krishna Raj","Body":"Best Messenger Application For All Time Love To This","Heading":"Best Messenger Application For All Time…","Rating":5,"Location":"IN"}
{"Date":"2022-09-06","Author":"Naomi Chukwujindu","Body":"Terrible. Nobody to help you with the app just the same unhelpful automatic response. Been trying to move it onto another phone for a week now. The verification code never sends, the call option never works and the waiting time only increases. Incredibly frustrating","Heading":"Terrible","Rating":1,"Location":"NG"}
{"Date":"2020-06-22","Author":"TrustPilot Is Shit","Body":"What a shambles of an App, and I can already see Facebook adding various crap in to this app including changing the share menu. Seems like development has hit the fan too, as WhatsApp business has a shocking amount of 1 star reviews, referring to various issues with the app that have existing for a while and fail to be fixed. What a shambles. Typical Facebook. Facebook and Instragram are poop, now WhatsApp is too since they've owned it.","Heading":"What a shambles of an App","Rating":1,"Location":"GB"}
{"Date":"2024-02-04","Author":"Ruthie Abigail Briggs","Body":"I tried emailing them about an issue whilst moving data from my old phone to my new one and the bot that sends emails just goes round in circles with you, not offering any actual support and solutions to the problem. Very frustrating. Don't bother.","Heading":"WhatsApp email support is awful","Rating":1,"Location":"GB"}
{"Date":"2021-04-24","Author":"Robert D. Gantt","Body":"Don't waste your time. This app is a scamming joke, developed by ignoranuses.","Heading":"Don't waste your time","Rating":1,"Location":"US"}
{"Date":"2021-05-20","Author":"Crofty","Body":"Disgraceful company just like Facebook and Instagram, how are these mammoth companies aloud to exist and trade without having customer support of any kind...you promote services like Whatsapp Business and then ban people from accessing their accounts, no one to speak to, no support at all...I'm going to take militant action against all your companies and ensure that I waste your time and money just like you have with myself!...think people can't walk into your office and cause serious problems!?","Heading":"Awful Company!","Rating":1,"Location":"GB"}
{"Date":"2024-04-01","Author":"STJ","Body":"I joined WhatsApp 2-3 days ago. This morning (1 April) I found the following message when opening WhatsApp: \"This account is not allowed to use WhatsApp\"!\n\nWhat is that all about?!  April's Fools Day?","Heading":"\"This account is not allowed to use WhatsApp\"","Rating":1,"Location":"GB"}
{"Date":"2020-07-16","Author":"Trinny","Body":"It’s a great app however I think it’s a bit overrated with younger people now. The main thing you do is text people however you can now do this on snapchat, Facebook and Instagram. The only difference is that these other apps have additional features like posting etc. It’s good for the older generation that don’t have other social media apps though.","Heading":"A little overrated","Rating":4,"Location":"GB"}
{"Date":"2021-08-02","Author":"ravinder kaur","Body":"Why is the archive file, file Visible on main screen .. I hate it change it back.","Heading":"Why is the archive file","Rating":1,"Location":"GB"}
{"Date":"2019-03-04","Author":"Marc Hallsworth","Body":"Whatsapp, what a wonderful tool to use when sending photos and any other media. You can set up groups so you can ALL be informed at the same time. It allows you to send high def pictures, (over 5meg) in seconds, where as it can take a lot of time to send the 5meg picture via other means. Another bonus, all of your messages and photos are encrypted, meaning, the information cannot be intercepted by anyone else except the recipient. Couldn’t live without Whatsapp. Thank you.","Heading":"Whatsapp, a wonderful app.","Rating":5,"Location":"GB"}
{"Date":"2019-08-23","Author":"Justin","Body":"Whatsapp is very good and I personally use WhatsApp. There is a little error in Whatsapp in IOS in 3D touch mobile phones. We can check our contacts status without informing him. Else WhatsApp is very good for chat and calls etc. I would recommend WhatsApp.","Heading":"Whatsapp is very good and I personally…","Rating":4,"Location":"PK"}
{"Date":"2020-08-20","Author":"Maxine Sullivan","Body":"THIS COMPANY MUST THINK ITS OK NOT TO BE CONTACTABLE BY THEIR USERS!! No email or contact number on their website to report a HACKING! Mobile Network provider won't supply a new number either. Someone has signed into a member of my families number and messaging people being FRAUDULENT, so much for WhatsApp being a safe app....... please contact us URGENTLY!!!!","Heading":"UNCONTACTABLE !!!! SHOCKING !!!!!","Rating":1,"Location":"GB"}
{"Date":"2024-02-03","Author":"المحترف السوسي للمعوميات","Body":"The WhatsApp application no longer deserves a star by the year 2024, as support cannot solve the problems of fans of this application, as WhatsApp blocks customer numbers without any prior notice. The biggest problem when talking to the support team is that you are answered by a bot that cannot solve the problem","Heading":"The WhatsApp application no longer…","Rating":1,"Location":"MA"}
{"Date":"2023-08-06","Author":"Phil Sergenti","Body":"This is the worst piece of consumer tech I ever seen. \n\nTelegram and Signals are superior in any dimension you can evaluate them against. \n\nHow many people are working on Whatsapp? The only thing they can release is new woke emojis every six months.\n\nDon't get me started on the API. Opening a Delaware company is way easier than complying with the following:\n- Whatsapp Commerce Policy\n- Whatsapp API ToS\n- Whatsapp Templates Guidelines\n- Whatsapp Privacy Policy\n- Zuckerberg's messianic tendencies\n\nEnjoy having your messages read by federal agencies.","Heading":"Makes you think about how important network effects are","Rating":1,"Location":"IT"}
{"Date":"2023-12-07","Author":"Beverly Petermann","Body":"They ban you for no reason! I downloaded the app to be able to communicate with my daughter while she’s on vacation. After a couple of days I am banned! I did nothing wrong!!!! You can’t email them about it, they only accept it through the app but I’m banned!!!!! Ridiculous!!! I did nothing wrong!!!!","Heading":"They ban you for no reason","Rating":1,"Location":"US"}
{"Date":"2019-07-03","Author":"Chris Sherlock","Body":"NEVER HAD A PROBLEM. NOW I CANT CHANGE PHOTO, IVE UNINSTALLED REINSTALLED. I HAVE A S8. WHAT A CRAPPY GLITCH. CLAP TUKIN CLAP. \nGEUSS THE WORDS IM USING AHAHAHA MORONS","Heading":"NEVER HAD A PROBLEM","Rating":1,"Location":"GB"}
{"Date":"2021-07-14","Author":"Teapot_Railfan","Body":"Since my phone is broken, on PC i can't even run my business with Whatsapp without getting forced to use my phone with massege 'Phone not connected' which is current on repair. Tryed reach customer service, but no luck.... just lazyness without any help! I'm thinking to switch to Telegram.","Heading":"Disgusting app, worst customer service","Rating":1,"Location":"HR"}
{"Date":"2023-09-28","Author":"Robert Grund","Body":"The last update is awful.\nThe way they add channels to the app is horrible","Heading":"The last update is awful.","Rating":1,"Location":"US"}
{"Date":"2021-10-21","Author":"Mona","Body":"So Rubbish APP ever!!!! 👎💩","Heading":"So Rubbish APP ever!!!!","Rating":1,"Location":"GB"}
{"Date":"2020-08-09","Author":"Kathleen Ross","Body":"Absolutely horrendous app. I sent a text at 6:30 pm. It is now 9:30 pm and the text has still not been sent. Uninstalling and looking elsewhere. Also tried sending them a message, which failed to send. No surprise there.","Heading":"Don't install WhatsApp","Rating":1,"Location":"US"}
{"Date":"2023-02-23","Author":"ASOEBI LAWAN","Body":"The Quick & Best Ways How, Nobody wants to be in a hopeless relationship. Often times people find themselves to be victims of a cheating spouse. The big concern about this is that you may not even know if your lover is cheating on you. People go for months even years not knowing until they finally find out. Even worse, they find out from everyone else who's been knowing making them look some what foolish. Wouldn't you like to save your time, effort, and emotions by finding out right now? I sure would and here's how, There's so many ways to catch a cheater that one article alone couldn't cover them all, however, I'm going to go over some quick and effective ways on how to catch a cheater. Plan a vacation or some sort of business\/family trip. Tell your lover what day you are expected to be back. So many people tend to cheat when they know their lover is out of town. The trick here is to show up around three to four days earlier than what you've told them. Also be sure to not tell anyone of this because you never know who he has on his side. If your lover has been recently working late hours at the office. Then it would be in your best interest to find out if he's really working. Show up at his office during the night shift with some form of gift. Whether it be something like his favorite dish that you cooked for dinner, etc. This is to help you not seem so suspicious of his actions. Check his cell phone. So many people use cell phones for all of their contacts and often times people who cheat either saves their significant other's phone number or it's left in their calls log. Check the dialed and received calls log and take note of any phone numbers which look suspicious. Aside from this yiu need UNIVERSALSPYSOLUTION on Gmail who is the best SPY to remotely get into your PARTNER phone without physical contact . It the best in California or call them +1 (802 )278 4316 good luck","Heading":"THE BEST WAY TO CATCH A CHEATING SPOUSE","Rating":5,"Location":"NG"}
{"Date":"2022-09-10","Author":"Georgiana Hall","Body":"Terrible for international calls. Just upgrade your cell service or try a video conference on one of the business apps like zoom.","Heading":"Terrible for international calls","Rating":2,"Location":"US"}
{"Date":"2023-12-04","Author":"Amit Roy","Body":"WhatsApp tracker","Heading":"WhatsApp tracker","Rating":5,"Location":"IN"}
{"Date":"2024-03-19","Author":"Aashish Kumar","Body":"Greetings, my name is Ashish, and my phone number is 9990083798, which I put of my nephew accidentally. Because of this, WhatsApp blocked me, so I'm asking you to kindly unblock my account. I still need my WhatsApp number, so please assist me please unblock my account ","Heading":"Unblock WhatsApp ","Rating":1,"Location":"IN"}
{"Date":"2019-03-14","Author":"Ashok Faquir","Body":"WhatsApp is great texting app which lets you send messages to any person who is using it and you can text and call people as well for free of cost the only thing you need is an internet connection. The app is being great for years, but recent updates has brought some changes which is making it little confusing and the status feature is gone as well.","Heading":"WhatsApp is great texting app which…","Rating":3,"Location":"GB"}
{"Date":"2023-12-31","Author":"Gamal Elkahlout","Body":"If you don’t care of your data, your chat archive, and all your memories suddenly, without warning. All you have to do is use the WhatsApp program...they canceled and deleted my account and the accounts of dozens of friends without reason or notice. This program also clearly stands on the side of the Zionists who kill women and children and does not respond to objection messages. This is the same policy followed in the occupied territories.","Heading":"Missing Credibility","Rating":1,"Location":"SA"}
{"Date":"2020-04-01","Author":"Vivian Hido","Body":"I cannot make calls unless I have wifi.  I cannot use my data\n Why this is happening","Heading":"I cannot make calls unless I have wifi","Rating":1,"Location":"CA"}
{"Date":"2022-10-27","Author":"Jordi Campos","Body":"META always ruining things! the worst company in existence, ever since the acquisition the iOS app is terrible, it always gets stuck it, and there's a bug that when you switch to landscape mode accidentally when sending a voice note the whole app freezes and you have to restart, WhatsApp web never works and when it does it takes forever to load!,","Heading":"Horrible!","Rating":1,"Location":"CR"}
{"Date":"2022-09-18","Author":"Megha Kainth","Body":"Terrible support. Whatsapp only provides you automatic replies. There is no human to answer your question.","Heading":"Terrible support","Rating":1,"Location":"NZ"}
{"Date":"2024-03-04","Author":"Zak Khan","Body":"My account got hacked however I had to wait 12 hours for a new verification code. \n\nWhen the 12 hours were up was messaged to wait another 12 hours. Watsapp Support ignorant of this.\n\nKeep stating to reinstall app etc","Heading":"My account got hacked however I had to…","Rating":1,"Location":"GB"}
{"Date":"2020-02-01","Author":"Silvia","Body":"WhatsApp support is the worst customer service body I have ever had the misfortune to contact. After my account got hacked , I asked for their help ; so they sent several emails ( clearly semi automated from their FAQs standard responses ) constantly repeating themselves. No regard for the customer at all or even for the use of  intelligent bods  to deal with their crap. Just appalling. Shocking!!!","Heading":"WhatsApp support is the worst customer…","Rating":1,"Location":"GB"}
{"Date":"2020-07-23","Author":"Amna Cheema","Body":"It’s the best app for chating and it’s really useful app just love this app","Heading":"Useful app","Rating":5,"Location":"DK"}
{"Date":"2018-12-14","Author":"Richard Macarthy","Body":"What's app is so much useful in sharing all kinds of files it's good,simple to use and voice message and video calling options are making this to stay at the top of the list no issues in using it. Every one should use this safe and secure developers are at their best","Heading":"What's app is so much useful in sharing…","Rating":3,"Location":"MX"}
{"Date":"2023-04-29","Author":"David Dickinson","Body":"Lucky to even get 1 star. Since they have taken over any company (Facebook, Meta) whatever you want to call them they have done nothing but ruins the good nature of that app\/company.they are ridiculous ( as I can only speak politely ) 3 times in 2 days they blocked my WhatsApp account for me adding mobile numbers to a WhatsApp group that I am an administrator.. and now they could be losing me my job .","Heading":"Lucky to even get 1 star","Rating":1,"Location":"GB"}
{"Date":"2023-09-03","Author":"ENG MARSHAL","Body":"One of the best applications for making connections around the world is WhatsApp","Heading":"FREE GLOBAL CONFECTIONS","Rating":5,"Location":"SO"}
{"Date":"2018-07-18","Author":"Mellanie Chalamagne","Body":"All the reservations I had about WhatsApp went out the window once they made it possible to delete text already sent. That soled me all the way:)","Heading":"All the reservations I had about…","Rating":5,"Location":"KE"}
{"Date":"2021-12-09","Author":"Scammerhunter","Body":"A lot of scammers use your app to do business. You should do something about it.","Heading":"Scammer's best app","Rating":1,"Location":"GR"}
{"Date":"2022-11-11","Author":"MONKEY","Body":"it didnt help me at all","Heading":"it didnt help me at all","Rating":1,"Location":"AU"}
{"Date":"2023-12-13","Author":"Tornike Asatiani","Body":"Terrible customer service! It is unbelievable how can a company like WhatsApp have such a terrible customer service that only responds to emails in a matter of hours. It is a platform for instant messaging where customers might be texting you every second and it takes hours for the support team to reply and there's no instant support available. Shame on you Meta!","Heading":"Terrible customer service","Rating":1,"Location":"GB"}
{"Date":"2012-01-10","Author":"Sofia","Body":"This is the best app on iPhone !!! I'm always connected to all my family and friends. It's available on all phone markets. I really wish it would b available for iPad as well as I recently sold my phone and got an iPad but I'm really disappointed coz it doesn't support what's app","Heading":"Best app on iTunes!!!","Rating":5,"Location":"GB"}
{"Date":"2020-12-16","Author":"BroskiBerry","Body":"Completely unsafe, any WA group pretty much means all members will have your private phone number. Just use Telegram.","Heading":"Who uses this?","Rating":2,"Location":"DE"}
{"Date":"2023-07-31","Author":"AB","Body":"I use WhatsApp on my computer as an installed program - not web based. It performs flawlessly. In the years that I've been using it I have never had one single problem. If I send a message from my phone it instantly appears on my computer and the same from my computer is instantly on my phone. This also goes with all the replies I receive. Everything is instantaneous. Brilliant piece of software.","Heading":"I use WhatsApp on my computer as an…","Rating":5,"Location":"RU"}
{"Date":"2024-05-27","Author":"Robert M","Body":"WhatsApp may be helpful contacting others in another country anywhere in the world, but unfortunately, Support does nothing to stop bad actors and fraudsters from using and abusing and scamming users. \nA negative report online achieves no response. \nRM","Heading":"Scammers rule over WhatsApp. ","Rating":1,"Location":"US"}
{"Date":"2023-07-15","Author":"ifra","Body":"the best feature about whatsApp , its chatting is very responsive and reliable. we can share pictures, videos, files attachments, music, audio notes, documents, location contact easily and rapidly.","Heading":"the best feature about whatsApp","Rating":4,"Location":"PK"}
{"Date":"2020-03-25","Author":"The Transgender Cupcake","Body":"A great thing. You can talk to no matter who behind borders if there is wi-fi and pay nothing for it!","Heading":"5 stars","Rating":5,"Location":"CZ"}
{"Date":"2022-07-09","Author":"Mr Jonathan Mayshar","Body":"In general the app is works  \nBUT\n   if a problem occurs, there is NO SUPPORT.\nThe support appears to be a predictive text BOT, \nat times suggesting that \"a problem\" is with the cell service provider.  All this is when a well defined problem is emailed to them.\nis this the META philosophy?","Heading":"In general the app is works","Rating":1,"Location":"GB"}
{"Date":"2019-06-01","Author":"John M","Body":"When used on a computer: You phone is not connected. How funny since I'm using my computer and not my phone. Horrible app!","Heading":"When used on a computer","Rating":1,"Location":"DK"}
{"Date":"2022-05-01","Author":"Jovan Ruzic","Body":"This is the single worst customer service experience I've had in my life. \nStickers didn't work on the web version of the app, I reported it. only to receive an automated reply of how I can log in the web app. \nI angrily replied asking to read it again, only to get a short \"clear the cache\" response. I was very clear that it doesn't help since I've tried multiple devices, clearing cache multiple times. \nThey just closed the issue. This was so horrible that \"Bad\" is a gross understatement.","Heading":"Single worst customer service","Rating":1,"Location":"RS"}
{"Date":"2024-02-20","Author":"Graham","Body":"No transparency, blocking number, no explanation. \n\nVery confused, no information, had to change numbers twice. \n\nHappy to change something if it was explained, but no idea what the issue is.","Heading":"No transparency, blocking number, no explanation","Rating":1,"Location":"GB"}
{"Date":"2020-05-11","Author":"Cristian Stefanescu","Body":"Whatsapp sucks. As an admin you have virtually no rights over the group you created. People can post anything including hate messages and use of bad language as an admin, you cannot delete their messages, you cannot give the a cool-down period, nothing. Out of control.","Heading":"Whatsapp sucks","Rating":1,"Location":"QA"}
{"Date":"2022-12-07","Author":"Tim","Body":"WhatsApp customer service is absolutely nonexistent – what a useless organization!!! But then it is part of Meta and like anything American it is only concerned with profit: quality and good customer service are not part of the culture\n\nGod Bless Earth! God Save Earth!","Heading":"WhatsApp Customer Service","Rating":1,"Location":"GB"}
{"Date":"2020-03-12","Author":"Nehal Singh","Body":"Really like it","Heading":"Really like it","Rating":5,"Location":"IN"}
{"Date":"2019-08-18","Author":"NIDHI THAKKER","Body":"Pls forward options and chat option should both be different \nAt present if any one want to forward any message it takes to much time as u r giving 3 option in whatsapp \n1.chat.2.status 3.call pls make one column of forward system or any other way \n\nAnd status option should be limited I think","Heading":"Pls forward options and chat option…","Rating":1,"Location":"IN"}
{"Date":"2020-08-28","Author":"Rajya ghoshal ","Body":"would say,that the app is very comfortable to use and very easy.I use it every day.","Heading":"would say,that the app is very…","Rating":4,"Location":"IN"}
{"Date":"2021-12-09","Author":"Seth Baidoo","Body":"It's quite positive and more helpful to the world at large. Since the inception of this app. I have personally read a lot of reviews concerning this particular app and trust me about 80% point to the fact that it's more helpful than coursing harm to the world. Communication has become easier and Businesses have also thrieved over the years. My experience with this app has brought me more fortune both in business wise and in communication in general. I therefore promote this app more seriously.","Heading":"WhatsApp Is doing more good than harm","Rating":4,"Location":"GH"}
{"Date":"2023-10-03","Author":"Ahsan siddiqui","Body":"WhatsApp service is very very bad.\nI'm from Pakistan.\nCantact me this Number.\n\n+92-3333413343\nLast month August Suddenly my whatsapp stopped working.\n\nAfter that I am tried to ask a lot of time contact whatsapp support team but they didn't give me any specific answer.\nI am very worried it's been two months my whatsappapp was shut down without any notice.\nI found no such rules violation because of which my account has been banned.\nkindle anyone who can see this issue please help me my whatsapp is not working since two months.\nI am in so much trouble so much problem to communicate with my friends relatives happening.","Heading":"WhatsApp service is very very bad.","Rating":1,"Location":"PK"}
{"Date":"2020-03-11","Author":"Renu Sharma","Body":"Hi I love WhatsApp but I just want to say it can be frustrating when in a group chat people know when you've read a messafe. In an update it could be an idea to have an option for that a bit like read receipts.\nThanks for your time 😊","Heading":"Hi I love WhatsApp but I just want to…","Rating":5,"Location":"IN"}
{"Date":"2019-07-10","Author":"Isaac Mwotasubi","Body":"Great service, \nThough the addition to the group without my permission annoys, or since I'm added without permission group members should not be notified when I leave, notification of \"0784 xxxxxx left\" should only be visible to the admin, not all members. thanks","Heading":"Great service","Rating":3,"Location":"UG"}
{"Date":"2020-05-09","Author":"bunny","Body":"Please Add filters on video calling like azar app ? For better lighting and view","Heading":"Please Add filters like a azar app","Rating":1,"Location":"IN"}
{"Date":"2020-04-13","Author":"Lau Hui Meng","Body":"I actually like this app as it is actually easy to use. But I have a problem using it because  I can't get quick reply from  any receivers who are my lecturers and friends,,,,, need to wait for a few hours on average then only can receive a reply....","Heading":"I actually like this app as it is…","Rating":3,"Location":"MY"}
{"Date":"2020-04-26","Author":"Sajjad Khan","Body":"I got badly stuck but still waiting to get the verification code , it getting more time longer ever time there in it help line if you got stuck then forget about the help I will say better use viber or some other software if you get stuck you will\nNever get help out they just give you services to use once you stuck there is no help at all","Heading":"I got badly stuck but still waiting to…","Rating":1,"Location":"IE"}
{"Date":"2020-02-18","Author":"Dan Rush","Body":"Use this free app for connecting with my friends abroad. Very nice and easy to use.","Heading":"Use this free app for connecting with…","Rating":4,"Location":"US"}
{"Date":"2020-02-12","Author":"Fern","Body":"Great app get to make video calls   share videos clips pics name it. Best app to speak to your loved ones no matter where they are","Heading":"Great app get to make video calls  …","Rating":5,"Location":"LC"}
{"Date":"2022-01-09","Author":"ELLZER","Body":"Make a ipad , tablet version.","Heading":"Make a ipad version.","Rating":3,"Location":"US"}
{"Date":"2020-07-28","Author":"Alisha Jacques","Body":"It has way to many catfish scammers that start on dating sites like plent of fish  saying they are in the army or where ever military but they are mit the people the portray   and then you call them out they will not do videos","Heading":"It has way to many catfish scammers…","Rating":1,"Location":"US"}
{"Date":"2019-05-28","Author":"David Hardie","Body":"It is excellent for messages but the call part rarely works first time AND IT IS TOO TOO TOO EASY TO MAKE A CALL IN ERROR. Twice in the last 12 hours someone has clicked on my missed call in the middle of the night and initiated a call to me. WhatsApp people, stop making it too easy to call someone in error.","Heading":"It is excellent for messages but.....","Rating":3,"Location":"GB"}
{"Date":"2018-04-16","Author":"Thomas","Body":"Bringing safe communication to a billion users, this is really positive as you can find a majority of your friends using this app. Their web page allows for use of a PC for easier typing of messages on a real keyboard, but lacks voice - which Viber offers.\n\nAlso it seems any media sent via the app is at least not securely saved on your mobile device, in open directories. Signal is more secure as no metadata is available to 3rd parties as it's not being logged by Facebook. But at least your chats are secure and the app is used by many mobile users.\n\nI think it was blocked by the Great Firewall when I was visiting mainland China. Yahoo and Microsoft were not blocked.","Heading":"Bringing safe communication to a…","Rating":4,"Location":"DE"}
{"Date":"2019-10-12","Author":"Geof Lawrence","Body":"Whatsapp is shockingly bad. Far too difficult to search for anything - persistently defaults to local area. \nReviews do not fade with time so if a business improves or declines with time WA does not indicate that.\n\nUseless","Heading":"Whatsapp is shockingly bad","Rating":1,"Location":"GB"}
{"Date":"2020-03-12","Author":"BittuBeyDardi ","Body":"I thing its a best for the communication since past many years. It had great features to enhance the communication👌","Heading":"I thing its a best for the…","Rating":5,"Location":"IN"}
{"Date":"2021-05-05","Author":"Aj creation","Body":"Whataspp best app connect friends and familys. Style very marvelous, video calling and group calling nice, privacy settings hard, I'm long time use this app really fabulous nice one.","Heading":"Connecting","Rating":4,"Location":"IN"}
{"Date":"2018-09-03","Author":"Arun Kumar","Body":"BUT PLEASE ADD FEATURE FOR ATTACHING FILE WITH MESSAGE SENT,\nSO WE CAN TAG A PARTICULAR REFERENCE FILE WITH A MESSAGE SENT TO SOMEONE.\nIT WILL REALLY HELP FUL FOR BUSINESS COMMUNICATION","Heading":"BUT PLEASE ADD FEATURE FOR ATTACHING…","Rating":5,"Location":"IN"}
{"Date":"2024-05-07","Author":"Iron Trooper Haloe","Body":"There is 0 customer service. The app does nothing to stop scammers, people doing fraud and hackers. Absolutely nothing. Chats are not encrypted anyone can see anything you send through the app. Have tried for months to get help and have had absolutely nothing from WhatsApp. Do not recommend.","Heading":"There is 0 customer service","Rating":1,"Location":"NL"}
{"Date":"2020-02-26","Author":"Madison","Body":"Hi I love WhatsApp but I just want to say it can be frustrating when in a group chat people know when you've read a messafe. In an update it could be an idea to have an option for that a bit like read receipts.\nThanks for your time 😊","Heading":"Hi I love WhatsApp group chats","Rating":4,"Location":"GB"}
{"Date":"2024-04-22","Author":"Dee","Body":"There are scammers on Whatsapp who are using this website to impersonate people who are training you to do a legitimate job. \n It's not legitimate!  The trainers are nice and polite and train you to a point where you gain their trust. THEY TELL YOU At FIRST THEY TELL YOU THAT YOU NEED A FEW DOLLARS, IT COULD BE $100 TO CONTINUE WORKING, YOU CONSIDER IT BECAUSE YOU NEED TO WORK AND YOU NEED TO MAKE MONEY!   Then as the training proceeds, you are required to shell out more money.  This time, hundreds of dollars in order to keep working.  if you don't have the \nmoney, well, too bad, because the little money that you did give them is gone.  If you tell them you don't have the money, then they tell you to borrow the money from family and friends.  You tell them you can't and they keep pressing you to do that. Don't let them scam you further! When they tell you that you need $200-$300 or more to continue working, DON'T DO IT!  But I'm letting you know so that you don't give them ANY money!  Once they tell you that you have to pay to keep working, drop them!  WHATS APP IS A GOOD SITE, BUT THE SCAMMERS HAVE INFILTRATED IT!  BEWARE!","Heading":"BEWARE OF SCAMMERS ON WHATSAPP WHO ARE OFFERING YOU A JOB THAT PAYS UP TO $150\/DAY!","Rating":2,"Location":"US"}
{"Date":"2021-02-22","Author":"Colin Shearn","Body":"WhatsApp T&Cs require you to provide all your mobile's contacts to them. If you do that without the prior agreement from your contacts, you would be breaching privacy and data protection law in Europe.","Heading":"WhatsApp T&Cs breach data protection law","Rating":1,"Location":"GB"}
{"Date":"2023-07-18","Author":"Mike","Body":"This app is helpful.\nBUT it's hard to use.\nI only chat with my workmate.","Heading":"hard to use","Rating":3,"Location":"ES"}
{"Date":"2020-04-11","Author":"oana boiciuc","Body":"It sucks since Zuckerberg bought it. Now it doesn 't allow you to send messages to more than one person.I feel like during communist times.","Heading":"It sucks since Zuckerberg bought it","Rating":1,"Location":"RO"}
{"Date":"2018-11-28","Author":"Jack Doyle","Body":"The app itself works very well, but the web version is terribly buggy, please look into this.","Heading":"Fix the web client","Rating":3,"Location":"UA"}
{"Date":"2021-03-20","Author":"TrustedReviews","Body":"The App itself isn't bad, but they are very slow at implementing features that other Messengers have had for a long time. Combined with the greediness of Zuckerberg wanting to get all our private information I just don't see a reason to stick with WhatsApp. I'm going to delete it as soon as I can convince more people to change to Telegram.","Heading":"Zuckerberg...","Rating":2,"Location":"CH"}
{"Date":"2021-09-06","Author":"Jeremia Wijaya","Body":"Keep stealing data and our privacy. What a dumbass company!","Heading":"Keep stealing data and our privacy","Rating":1,"Location":"ID"}
{"Date":"2019-10-24","Author":"Catherine","Body":"Video chat is horrible. Absolutely unable to converse. Too choppy. Cuts in and out and freezes. Terrible.","Heading":"Video chat is horrible","Rating":1,"Location":"CA"}
{"Date":"2023-04-14","Author":"Jay","Body":"Tech support not even replying!\n\nAfter getting fobbed off by WhatsApp i spent ages with Apple support who were amazing and they confirmed there’s a bug in WhatsApp & the new IOS update so I went back to WhatsApp and had 1 chat closed as soon as I mentioned the CarPlay issue & another 2 chats not even respond. \n\nAbsolutely shocking company.","Heading":"Tech support not even replying!","Rating":1,"Location":"GB"}
{"Date":"2022-11-12","Author":"Tim Grasmaijer","Body":"It is unbelievable how bad the customer support for such a big company is. They only send standard answers and when I keep repeating that this doesn't solve the problem, they don't respond anymore. It sucks that Whatsapp has such a strong network effect, I'd rather stop using completely.","Heading":"Unbelievably bad customer service 😡","Rating":1,"Location":"NL"}
{"Date":"2020-05-23","Author":"Jennifa Akther-Priya","Body":"This is the best messaging service to keep in contact with friends and family,  I think everyone needs this on their phones!\nI like the fact you can group video call, you don't need to have iPhone facetime.","Heading":"This is the best messaging service to…","Rating":5,"Location":"GB"}
{"Date":"2019-12-19","Author":"Philemon Rugierro","Body":"Isn't it about time WhatsApp made it impossible to add a user to a group without their express content?","Heading":"Isn't it about time WhatsApp made it…","Rating":3,"Location":"US"}
{"Date":"2022-09-27","Author":"Anna Podkorytova","Body":"My account was suddenly out of nowhere blocked. I did nothing at ALL, wokeup in the morning and found it locked. i requested a review and got rejected without explanation.\n\nUPDATE:\nThe worst customer service ever, very RUDE and not helpful at all.","Heading":"META sucks","Rating":1,"Location":"EG"}
{"Date":"2023-06-03","Author":"swadarshan","Body":"I see we all come here desperately to somehow make ourselves \"heard\" - since Whatsapp decided to abandon its customers and give ZERO SUPPORT to them in especially such big change, when they stop allowing many of its own users to continue use their \"services\". Yeah well, it's your choice Whatsapp, to give no $#!T about losing your own customers. Many people may use older Android phone FOR A REASON, but in my case, this would be about a perfectly working SURFACE PRO X latest updated Windows10 which is in fact runs neither on 64bit nor on 32, because it has an ARM based processor - so it CANNOT actually \"update its operation system\" to Whatsapp's limited favor. But they won't bother to read my issue nor answering it for over full week now, I send desperate messages to their so-called \"support\"-line nearly every day, and all they do is only trying to guess useless problems by a stupid bot. Obviously the robot is so stupid, cannot comprehend certain situations which aren't programmed into their knowledge. That's why Whatsapp should employ actual human beings to read our messages, but maybe they really just want to get rid of so many users?!?","Heading":"Without ANY support for genuine users WhatsApp decided to get rid of them","Rating":1,"Location":"GB"}
{"Date":"2014-12-22","Author":"Malene Andersen","Body":"I love this app..!\r\nSuch a great wonderful one, with no problems all.\r\nRly thumbs up,for that!!","Heading":"just great!","Rating":4,"Location":"DK"}
{"Date":"2024-01-27","Author":"Danny Green","Body":"Truly the worst tech support ever, they don't read what you write and shut you off after 3 messages","Heading":"Truly the worst tech support ever","Rating":1,"Location":"GB"}
{"Date":"2018-12-05","Author":"Daniel Meireles","Body":"The mobile app works really well but the web client has alot of bugs and glitches, please fix them!","Heading":"Web client is really buggy","Rating":3,"Location":"UA"}
{"Date":"2023-12-13","Author":"ric p","Body":"Whatsapp, you sofware enginner is a fool\n\nSo someone could send a company contact, but is a company you cant add him as a contact\n\nWhat a mierda of SE","Heading":"Whatsapp","Rating":1,"Location":"ES"}
{"Date":"2023-12-29","Author":"Malte Fog","Body":"…………………***","Heading":"Customer service","Rating":1,"Location":"DK"}
{"Date":"2021-03-18","Author":"MR COLIN FORSTER","Body":"We thought whatsapp was safe until we experienced this awful ban for no reason which cannot be rectified. We realise now that we've been scammed through whatsapp which makes us very insecure  We've deleted it from our phone and computer and advising our friends and family to do likewise and asking them to contact us safely through signal.com.","Heading":"We thought whatsapp was safe... until we…","Rating":1,"Location":"GB"}
{"Date":"2023-05-29","Author":"MB","Body":"Love Whatsapp - use it a lot\nespecially useful to send photos & docs on pc to phone\n\nBut recently Whatsapp is adking for an update on Windows - phone updated no problem but the Whatsapp on Windows 10 reports that it is \"Outdated\" - the app icon is greyed out and everytime you shut it down it you have to set it all up again - so annoying\nCustomer Services insist it is not their issue - when clearly something in the app script is not working with Windows 10 64bit anyway - cannot speak for 32bit\nWindows Microstore decides that you already have a copy of the app \/ does not see that you have need of an update - it seems that at least one other user - an Apple user - is having trouble updating also - that review made on Trust PIlot in April 2023 which suggests that there is a bug in the new app \/ app update","Heading":"Love Whatsapp but issues with Update driving me crazy","Rating":3,"Location":"GB"}
{"Date":"2022-12-01","Author":"Gabi","Body":"What a terrible application. Absolutely zero privacy. Supposedly private phone calls with your mother will result in phone calls from unhinged Airbnb workers repeating what was said in your Whatsapp conversation. The makers of these \"technologies\" are morons. I terminated my account and deleted the application. This type of service is for YouTube watchers, not me.","Heading":"What a terrible application","Rating":1,"Location":"GB"}
{"Date":"2024-02-01","Author":"sarah kreuz “itssarahkaay”","Body":"If someone sets 90 days with self-deleting messages in the chat - then the other party sees this because a message in the chat of WhatsApp with the message 90 days or the person has switched it off ect. - My question - why does this information have to be there forever - of course it is good if it is there once so that the person sees it but if this message is in the chat forever I find it ultra annoying!\nThen you could send video messages with the circle? \nThat feature no longer works either!","Heading":"If someone sets 90 days with…","Rating":1,"Location":"AT"}
{"Date":"2023-10-01","Author":"Consumer","Body":"Had same issue as others where latest update wiped all messages. Help\/support have been useless. When I told them I had tried all their suggestions I got a snippy email saying they had given me the solution already, and ended contact.","Heading":"Had same issue as others where latest…","Rating":1,"Location":"GB"}
{"Date":"2021-02-06","Author":"Vico","Body":"It is great site and app, it helps people to connect with each other in smooth way.\nStickers and gifs are superb.\nStatus and privacy options are cool.\nThe number of friends shown there is important.\nI hope the color of the app changes to yellow. \nThank you.","Heading":"Best quick app","Rating":5,"Location":"SY"}
{"Date":"2021-01-23","Author":"Dean L","Body":"I have never used any other messaging app other than WhatsApp - it works fine and I never knew any better, until the new T&E which now gives the permission to pass my personal WhatsApp data to their parent company Facebook. \n\nWhatsApp seems to be threatening its customers to accept these conditions or close your account. This is not good customer service or PR.\n\nUnfortunately, a pandora’s box has been unleashed  and as a long-time, loyal user, my eyes have been opened to stronger, more feature-rich and safer communication platforms out there, as Signal and Telegram. Privacy is important to users - WhatsApp is not reflecting that in their product and client ethos unfortunately.","Heading":"Privacy and respect for customers - none shown","Rating":1,"Location":"GB"}
{"Date":"2020-12-07","Author":"Naud Peters","Body":"I use whats app for communication, calls and quick chats. Its working very well on web and on mobile\nThank you, its a pleasure","Heading":"I use whats app for communication","Rating":5,"Location":"NL"}
{"Date":"2023-07-13","Author":"Zoltan Jobbagy","Body":"Easy to lose all messages for many years back. Don’t keep any important pictures or messages on it!!!","Heading":"Easy to lose all messages for many…","Rating":1,"Location":"GB"}
{"Date":"2019-11-09","Author":"Penny Sjöberg","Body":"I'm using this app everyday and it make contacting my family and friends very easy.","Heading":"I'm using this app everyday and it make…","Rating":4,"Location":"IL"}
{"Date":"2023-05-28","Author":"Butler","Body":"for the past month they keep banning me because of some imagined breach, i contact support and they investigate, unblock me, then the system blocks me again, this is happening virtually every other day, and even when i don't send anything, or open messages, there can be nothing happening on my account, yet I'm somehow breaching their  terms, its a farce, if there was an government  body i could complain to, i would.","Heading":"for the past month they keep banning me…","Rating":1,"Location":"GB"}
{"Date":"2024-04-30","Author":"Adam Bent","Body":"Like other people have said, support is non-existent.  Their auto-bot always gives you advice that you don't need, and then just eventually gives up and sends you on your way.  It is very infuriating when you encounter a problem.  Whilst everything is working, it is mostly fine.  I tried to report a bug to them ages ago, and I actually somehow got through to a real person, but they were adamant that their software is perfect and bug-free so must be user error, even though I am a software engineer.\nI don't understand how WhatsApp is so popular when the support is non-existent.  I am sure if they just started up now then they wouldn't have any customers.\nI had an issue yesterday where WhatsApp on my Android phone \"encountered an error\" and insisted it needed to perform a restore, so I let it.  That then resulted in deleting ALL messages from 3rd Feb to today because the last successful backup it did was 3rd Feb!!!  So, as you can imagine, I was majorly infuriated by this!!!!  I tried to contact WhatsApp about it but their auto-bot just gave me useless things to try and then gave up and sent me on my way.  So, I was now even MORE infuriated!!!","Heading":"Support is non-existent!","Rating":1,"Location":"GB"}
{"Date":"2018-02-07","Author":"Clare Whitehead","Body":"Although they are quick to respond, Whatsapp customer service are also like to bat you off to their FAQ section without asking for more information or providing help to more obscure problems. Whatsapp - great when it works, which it does very well most of the time, but if you get stuck! Good luck!","Heading":"If you get stuck, good luck!","Rating":3,"Location":"GB"}
{"Date":"2019-11-20","Author":"Adrian Kwiecien","Body":"Great app, love it so much.","Heading":"Great app","Rating":5,"Location":"GB"}
{"Date":"2024-04-10","Author":"Adrian Klobučník","Body":"The fact that I can't even do anything on my WhatsApp as I get immediately banned speaks for itself. I wish there would be 0\/5 option","Heading":"The worst user experience I've ever experienced from a well known company","Rating":1,"Location":"DK"}
{"Date":"2023-09-19","Author":"Hal","Body":"Love it for daily interaction, I’m now however put off from using it… WhatsApp you were unique in your own way? After the update they have copied Snapchat in terms of watching people’s status updates. \n\nYou could previously even see what was posted without opening on iPhone and you can no longer do that. 0 stars I will be deleting absolutely awful !! Moreover it was easy use for my elderly mum why complicate and change things !!!!","Heading":"BAD UPDATE. Will be deleting.","Rating":1,"Location":"GB"}
{"Date":"2018-05-07","Author":"Rachel Usher ","Body":"I love WhatsApp, I've been using this since they used to charge yearly for it. Totally worth it for free messaging, photo sending and calls. \n\nI've noticed that I've gone from having massive bills to hardly using any of my contract any more. Thanks WhatsApp!","Heading":"I love WhatsApp","Rating":5,"Location":"GB"}
{"Date":"2023-07-13","Author":"Angga Agia Wardhana","Body":"we just bought corporate number and the number promptly get banned on whatsapp. we are not even finished setting up whatsapp app.\n\ntrying contact support is like talking to a wall, they keep looping to the article, the doesn't even give explanation, super useless, I don't know if they are using AI to respond, but I'm already at loss contacting them. \n\nI would give 0 stars or minus a million star for their support if I could.\n\nto any company that have support, learn from whatsapp on how NOT TO SUPPORT your customer and keep them in an infinite email loop","Heading":"whatsapp support = USELESS","Rating":1,"Location":"ID"}
{"Date":"2021-01-12","Author":"Dark Angel","Body":"Big brother is watching you !\n\nBOYCOTT WHATSAPP \n\nNous sommes tous notés","Heading":"Big brother is watching you !","Rating":1,"Location":"FR"}
{"Date":"2022-11-18","Author":"william bell","Body":"If I could, I’d give WhatsApp zero stars, in fact negative 5*; actually negative a million!. Their support is the worst - the VERY WORST - in the industry. But you know what - they DON’T CARE. It is all deliberate - designed to stop customers seeking help - arrogance of the highest order.\n\nThere is an issue with the Chat Auto Backup - the issue is quite simple - IT DOES NOT WORK. I have had this problem for most of this year. And despite numerous attempts, WhatsApp have FAILED MISERABLY to resolve. In fact, their favourite tactic is to just push back on the customer - they NEVER want to accept responsibility for anything or acknowledge anything is wrong.\n\nNow get this: their latest solution (sent by a very rare email) FAILED. So, I replied to THEIR email on the very issue. Their reply was INCREDULOUS: “Unfortunately, this issue is out of scope of WhatsApp Support!”.\n\nHow can that be when THEY sent the VERY EMAIL offering THEIR solution (that did not work) on the VERY ISSUE being discussed?\n\nLike I said - it is all a deliberate ploy to stop users contacting them.\n\nEither that, or the people employed in WhatsApp support are illiterate, and completely and utter STUPID.\n\nBut you know what - it doesn’t matter how many people write bad reviews - nothing will change - THEY SIMPLY DON’T CARE.\n\nIn fact, they probably relish the bad reviews – sitting back relaxing in the canteen (because quite clearly they are incapable of any kind of serious work) having a good laugh at the expense of all of us that have posted negative reviews.","Heading":"WORST SUPPORT IN THE IT INDUSTRY ANYWHERE IN THE WORLD","Rating":1,"Location":"GB"}
{"Date":"2023-07-21","Author":"Ficus","Body":"My WhatsApp is flooded with messages, and I can't access them anymore because of limited space. Whenever I try to delete some messages, WhatsApp won't allow it, leaving me unable to use the app. It's frustrating and disappointing that WhatsApp has also locked my account. This is a real problem, and I hope they address it soon.","Heading":"Message Overflow and App Lockdown","Rating":1,"Location":"GB"}
{"Date":"2021-07-29","Author":"marcus hunta","Body":"The new Whats app is terrible, you should be able to hang up on someone who’s not answering","Heading":"The new Whats app is terrible","Rating":1,"Location":"GB"}
{"Date":"2020-04-11","Author":"Jan Hollestelle","Body":"since it belongs to Facebook it sucks.  first 5 now 1.they are just going for extra money. I hate them","Heading":"since it belongs to Facebook it sucks","Rating":1,"Location":"NL"}
{"Date":"2023-12-07","Author":"Bemuka Kajura Marvin","Body":"My account  was banned from what's app yet I didn't go against the terms please,  I can't  access  my  chatts  anymore please  +256 703 979239  is account number.  I will be grateful to  hear from you  about  my account please","Heading":"My account  was banned from what's app…","Rating":3,"Location":"US"}
{"Date":"2023-11-27","Author":"Lilwhipboi","Body":"You literally can just talk to ur friends for free and it's good and you can have groups and all that and no chat moderation like Roblox does","Heading":"Free messages","Rating":5,"Location":"GB"}
{"Date":"2020-03-08","Author":"Appu K","Body":"Best app i love very much","Heading":"Best app","Rating":5,"Location":"IN"}
{"Date":"2023-09-09","Author":"Faiz Khan","Body":"WhatsApp is very good it has many conveniences","Heading":"WhatsApp is very good it has many…","Rating":4,"Location":"PK"}
{"Date":"2019-11-09","Author":"Rup Art ","Body":"WHATSAPP IS WORST APP IN THIS WORLD Data TRANSFER IS WORST.\n\nWECHAT IS THE BEST IN THIS. \nIF POSSIBLE DON'T USE WHATSAPP...","Heading":"WHATSAPP IS WORST APP IN THIS WORLD","Rating":1,"Location":"AE"}
{"Date":"2018-12-29","Author":"Bharat Mishra","Body":"Since last month chat history has been disappearing chronologically. Now trend has changed, every morning I find one or two chat history disappeared. I'm using MOTO G4 Plus mobile and recently got to know through google search that there are many people facing the same issue. \nSurprisingly whatsapp doesn't revert to this problem as more than 25 mails I have written to their support team. I had tried reinstalling app almost five times and reset my mobile too but nothing changed. I even stopped using antivirus and cleaning app to avoid any confusion.","Heading":"Whatsapp Chat History Disappearing Automatically everyday","Rating":1,"Location":"IN"}
{"Date":"2023-01-26","Author":"Adegboye Judith","Body":"WhatsApp is a highly popular messaging app that allows users to easily communicate with friends and family through instant messaging, voice and video calls, and group chats. It is available for both iOS and Android devices, and it is known for its user-friendly interface and robust features. Some of its key features include end-to-end encryption for increased security, the ability to send and receive multimedia files, and the ability to make group calls with up to eight people. Overall, WhatsApp is a reliable and easy-to-use app that is widely recommended for anyone looking for a good messaging app.","Heading":"WhatsApp is a highly popular messaging…","Rating":5,"Location":"NG"}
{"Date":"2023-05-02","Author":"Timbrukah","Body":"For all the people going absolutely stir crazy trying to update WhatsApp using the Microsoft Store, this is for you.\nI don't know how many hours I wasted trying to upgrade, troubleshooting, uninstalling, re-installing WhatsApp from the Microsoft Store.\nIt was a complete and utter and frustrating waste of time.\nOn its Home Page, WhatsApp said \"You can use WhatsApp Web.\"\nWhich I took to mean you could access your WhatsApp account by logging into the WhatsApp website.\nI couldn't actually find the website, which is not WA + web but web *dot* wa [spelled out] *dot* com.\nOnce I rebooted my phone so it would read QR codes and clicked Link Device, it took less than a minute to upgrade to the new WhatsApp!\nWhy WA didn't make this clear on their Home Page, I don't know.\nIn any case, I hope this spares at least a few people many hours of frustration.","Heading":"Bumped up from 2 stars to 4. Quick WA upgrade trick.","Rating":4,"Location":"GB"}
{"Date":"2020-03-12","Author":"hi souvik","Body":"Big social media i really like it","Heading":"Big social media i really like it","Rating":5,"Location":"IN"}
{"Date":"2022-10-25","Author":"Ellen","Body":"After Meta buy whatsapp, the service is always unstable, and got a lot of non stop advertising. most annoying part is they will create group and add your mobile as admin. terriable, today i down again.\nMeta should find somebody to do better.","Heading":"always down","Rating":1,"Location":"HK"}
{"Date":"2023-09-24","Author":"Marmot","Body":"I have lost 8 years of messages and it is absolutely devastating. It is far too easy to lose your entire chat history on this app.","Heading":"I have lost 8 years of messages and it…","Rating":1,"Location":"AU"}
{"Date":"2019-08-05","Author":"Elhanan","Body":"Used WhatsApp for years and it's still the best chat app. I use it to communicate with family, friends, and clients. Most of my business happens though WhatsApp. All history is available when devices are switched. Maybe Telegram will prevail eventually but WhatsApp is still the best.","Heading":"Still the best chat app despite growing competition","Rating":5,"Location":"PT"}
{"Date":"2024-04-11","Author":"Mark Wade","Body":"Keeps backing up without consent ","Heading":"Keeps backing up without consent","Rating":1,"Location":"GB"}
{"Date":"2020-12-11","Author":"Becky","Body":"If you're a millennial like me, you prefer to chat via text to any other type of communication. Whatsapp is perfect for this and it's so intuitive even my mom can use it (she's 60!). I love that they have a desktop version too.","Heading":"Best way to keep in touch with your close ones","Rating":5,"Location":"US"}
{"Date":"2023-03-18","Author":"Tamasine Smith","Body":"Exactly as others have written. Customer support is completely rubbish and inappropriate. Just pump out standard responses without reading the problem then close the chat without resolving anything. I also can’t add numbers without someone messaging me first. This is disrupting my business for which I use WhatsApp a lot. The actual messaging and video side is great but service is non existent","Heading":"Rubbish service - Exactly as others have written","Rating":1,"Location":"GB"}
{"Date":"2021-01-08","Author":"KEITH BOND","Body":"In general, I like WhatsApp. It has it's faults, but would miss not having it. Of great concern is their latest Privacy Laws. If you don't accept them you can't use the service. The main issue, the complete opposite to privacy, in that they will be sharing all your personal information on other platforms, including mobile phone numbers. Very intrusive.","Heading":"Be Aware of New Privacy Rules","Rating":3,"Location":"GB"}
{"Date":"2024-02-09","Author":"Rob","Body":"Waste of time. Entire platform relies on shody automation. It's clear they have made sacrifices to cut costs which allows scammers to proliferate and operate en-masse at the cost of genuine user experience.\n\nI had a number banned because I was communicating with a pig butchering scammer and they had reported me - yes, of course the scammer is still operating without any hinderence. I tried putting through an explanation to their support and their shody automation told me the typical \"we know what you did\" response without any review.\n\nIt's clear Meta's strategy here is to use garbage automation that relies on a reputation system and then expect users to change their numbers instead since they offer no meaningful support for the issues they cause.","Heading":"Waste of time - Just use Signal","Rating":1,"Location":"NZ"}
{"Date":"2019-12-28","Author":"Kathleen Waldner","Body":"I can't use my 605 number to open what's app and ive used it before I just got a different phone now I can't use it anymore ...","Heading":"I can use my 605 numver to open what's…","Rating":1,"Location":"US"}
{"Date":"2020-08-11","Author":"Julia S","Body":"Reasonably happy with the app until trying to transfer from Android to iphone. This is a common issue – why on earth they don't address the incompatibility is beyond me. Godawful customer service. Now I have the choice to lose 10 years of chats or pay a dodgy third-party app that may or may not work. Wish I'd gone for a different chat app in the first place.","Heading":"Reasonably happy with the app until…","Rating":1,"Location":"GB"}
{"Date":"2018-10-04","Author":"Greg Angus","Body":"I have people in other countries trying to contact me. When they enter my number, they get a message that my number is \"unregistered\".   Prior to giving my number to these folks, I successfully registered with the app. At least the app said I did.\n\nI wrote them a week ago for help, and have not made any progress. I've supplied all the information asked for.  I don't believe there is any follow-up at this company.   My emails supplying what they want to know are ignored, and I am still not working.","Heading":"I feel sorry for anyone who has to deal with support of this app.","Rating":2,"Location":"US"}
{"Date":"2024-05-03","Author":"Brassed off","Body":"Has whatsapp been sold to gangsters? After my phone exploded in flames I tried to set up my whatsapp account on my new phone. After 3 days of wasting my precious time, I suspect wa will not work on my phone; the whatsapp website will not tell me which phones are compatible, nor does it have any useful advice. Whatsapp does not want customers apparently. It is always sad to see a good service going down the toilet usually it is because some snooty idiot, a free rape market entrepreneur, grabs power in the board. Is whatsapp now the Trump of apps?","Heading":"Has whatsapp been sold to gangsters","Rating":1,"Location":"GB"}
{"Date":"2020-01-02","Author":"Andrew Couronne","Body":"It's a shame that you allow nations such as Wales or Scotland to have their flag emojis but you don't allow Basque Country (Euzkadi) to have its flag emoji despite thousands and thousands of signatures requesting it. Shame on WhatsApp!","Heading":"It's a shame that you allow nations…","Rating":2,"Location":"ES"}
{"Date":"2020-01-03","Author":"Ravan","Body":"I'am giving 3 stars bcoz for a while i'am facing few spam msgs from unknown ppl. every time i block d number i get it in different number. i request the whats app group to look into those number n ban them.\nAnd one more thing is to request u ppl to raise the bars for number of sharing info to ppl from 5 to 10 o 15.\nBcoz wen u have contacts over 60 to 70, its difficult to reply every one wen it is limited to only 5 members. \nAnd the last request is plz don't block us for a day or more \"unnecessarily\" without giving any reasons, and tell us to search in the links, thats a difficult part. Or give the answer dirrectly.","Heading":"I'am giving 3 stars bcoz for …","Rating":3,"Location":"IN"}
{"Date":"2020-01-02","Author":"Nilasri Chakrabarty","Body":"Unnecessarily blocking user. Having no proper reason as well... We are accepting u as our means of communication that doesn't mean u will do whatever u like.","Heading":"Unnecessarily blocking user","Rating":1,"Location":"IN"}
{"Date":"2021-12-27","Author":"Aptivi","Body":"My family has been using WhatsApp ever since they got their hands on their first Android phone somewhere around 2012-2014, and they're still using it for communication. I hate to admit that I was the last in person who officially started using WhatsApp in late 2020, despite having my first Android phone in 2014.\n\nThey all use this app to communicate with family members and friends. I use it personally to do the same thing. However, as a student, I tend to use this app more for communication with classmates and best friends and being in the group of our class for updates regarding studying.\n\nHowever, I was subject to a Syrian harasser who's not in my school and a person whose name I don't know who added me to a group without my permission which has a group of morons who's ready to harass me and their victims. I left and reported the group, blocked the person, reported them, and I never heard from them since.\n\nMy phone is rooted and WhatsApp worked as if nothing happened for more than a year. I can receive and send messages as usual. I can even send messages to a classmate who's using an iPhone and receive messages to Android. That is cross-platform messaging (Send on iOS and receive on Android, or the other way around).\n\nThe other flaw is that you need to update the app constantly, as failure in doing this step may lead to the app telling the user to update before starting again.\n\nWhen it comes to notifications, it's very smart. Turn off your WiFi and\/or data, wait for your group or your contacts to send you messages in the meantime, then turn on the WiFi and\/or data. An influx of notifications that shows that you've received these messages appears. When WhatsApp detects that there's a new message, it briefly shows \"Checking for new messages\" in the notification panel before showing the message. This system ensured that I don't miss any message, although I don't know if this same experience applies to iOS.\n\nYou can even insert your custom background as your chat background and make the whole app turn into dark mode on supported and unsupported devices.\n\nThe last thing which I will tell you is that it's owned by Facebook (Mark Zuckerberg). The latest version of the app shows that it's from Metaverse.","Heading":"Decent and dynamic messaging app despite flaws","Rating":4,"Location":"SY"}
{"Date":"2020-07-23","Author":"j.scott","Body":"best app for texting","Heading":"best app for texting","Rating":5,"Location":"BG"}
{"Date":"2015-02-13","Author":"Jessica Waldorf","Body":"Brilliant invention which helps me stay in touch with dear people in a more private manner (in relation to the social networks).","Heading":"The best app ever!","Rating":5,"Location":"RS"}
{"Date":"2023-11-07","Author":"Richard Axon","Body":"Allows scammers to continue using the app even after all the evidence, these people should be blocked, you company is helping cyber fraud instead of preventing it, disgraceful","Heading":"Allows scammers to continue using the…","Rating":1,"Location":"GB"}
{"Date":"2019-12-15","Author":"Tanya Shukla","Body":"They are criminally negligent to ignore reports of identity thefts using their platform. I have requested that my account be deleted after it got hacked and the hacker was then contacting all my friends. However, all I get is computer generated messages. Just like banks are bound to deactivate cards after being stolen, WhatsApp must deactivate accounts that are stolen with immediate effect. I will be taking this negligence up legally as there is absolutely no sense of responsibility on behalf of WhatsApp which is appalling","Heading":"They are criminally negligent to ignore…","Rating":1,"Location":"GB"}
{"Date":"2023-12-07","Author":"Zebedee7 ","Body":"I received a call earlier, they probably hung up not realising I heard my iPhone ring once - it came from Iran, I do not know anybody who lives there (I only know people who live in the UK). Complete scam. I reported this to WhatsApp but they’ve not been helpful, I do not use it nowadays unless only able to contact a company that way - only had to do this twice. I shall delete my account, as I did before. Cannot trust it.","Heading":"I found I received a scam call","Rating":1,"Location":"GB"}
{"Date":"2019-11-01","Author":"Ninaapril13 Nina April","Body":"I lost my sim card. wanted to deactivate old number... changed whatsapp with a new number but old whatsapp still showing as a working account. tried to contact with service centre but no one answered.. need to add more details during registration example email, or another number in such a cases if I lost my whatsapp SIM card.","Heading":"I lost my sim card","Rating":1,"Location":"GE"}
{"Date":"2024-01-04","Author":"Pradeep Singh","Body":"My WhatsApp number is banned from yesterday morning no one is answering no customer support truely monopoly worst service not even replied by customer suppor","Heading":"My WhatsApp number is banned from…","Rating":1,"Location":"IN"}
{"Date":"2023-11-30","Author":"Keegan Vice","Body":"Great product and free to use. Too bad the US dies not use it","Heading":"Great product and free to use","Rating":5,"Location":"US"}
{"Date":"2020-12-17","Author":"nteere nteere","Body":"Great and efficient eassy 2 use overall \nthanks for improvemtnt","Heading":"Great and efficient eassy 2 use overall…","Rating":5,"Location":"KE"}
{"Date":"2022-03-17","Author":"Paul Mckinley","Body":"Make it impossible to see on a different phone.\nImpossible to see access when you have phone stolen.\nBack up should be easier.","Heading":"Very annoying","Rating":1,"Location":"GB"}
{"Date":"2020-08-16","Author":"Karl Werner","Body":"cool.\nI would say,that the app is very comfortable to use and very easy.I use it every day and i cant say,that it is bad or not good","Heading":"cool.","Rating":3,"Location":"CH"}
{"Date":"2020-07-09","Author":"Daniel Meeks","Body":"not  interested in this app at all","Heading":"not  interested in this app at all","Rating":1,"Location":"US"}
{"Date":"2021-05-23","Author":"Kyle Knight","Body":"WhatsApp has always been my go to for general discussions and is a staple for everyone to socialise on.\n\nI don’t get why WhatsApp forces people to show as online. Why can’t we just reply when we can and browse the app at our own leisure without feeling like we are ignoring people?","Heading":"Good little app","Rating":4,"Location":"GB"}
{"Date":"2024-02-14","Author":"Marnie","Body":"Awful, randomly blocked our business account for no reason, impossible to get hold of anyone to get this sorted.","Heading":"AVOID!!!!","Rating":1,"Location":"GB"}
{"Date":"2019-05-03","Author":"Fiwa togbonou","Body":"I've been using it for several years now and it's a good app. Also when they added the feature that allows you to delete messages already sent within the first 7min, I found that awesome. The only issue is that ~it leaves a notification that there is a deleted message~ that both you and the receiver can see which just make it worse because the receiver will now be asking you what you deleted and why, and If you don't want to talk about it (which is the reason why you deleted the message in the first place), it just makes the situation awkward.","Heading":"Good app overall","Rating":4,"Location":"US"}
{"Date":"2023-09-30","Author":"Jennifer Mast","Body":"I’m so disappointed with the new update and the addition of the channels. I felt that WhatsApp was a safe pla for my children but now with the channels option I do not feel that it is safe. I will be deleting four accounts because of this.","Heading":"I’m so disappointed with the new update…","Rating":1,"Location":"US"}
{"Date":"2014-09-10","Author":"salma tariq ","Body":"absolutely the ability to stay in contact with the family in 'OUR GROUP'..keep in touch and never miss a moment with the family!","Heading":"what a brilliant app.","Rating":5,"Location":"GB"}
{"Date":"2019-09-11","Author":"Jeff Friedman","Body":"I love this service so much, use it every day!","Heading":"I love this service so much","Rating":5,"Location":"CA"}
{"Date":"2023-07-12","Author":"James Dawson","Body":"WhatsApp is only working when connected to wifi. Also Instagram the same, so I presume it’s a meta issue as everything else on my phone is fine . It’s been like this for 4 months now and the only reply I get is this…..\n\nHi,\n\nThanks for your message.\n\nUnfortunately, this issue is out of the scope of support that WhatsApp can provide.\n\nIf you have any other questions or concerns, please feel free to contact us. We'll be happy to help!","Heading":"WhatsApp not working and support is useless","Rating":1,"Location":"GB"}
{"Date":"2023-04-24","Author":"rose","Body":"I really want to know if it's possible to forward messages and photos in the same order.\nSay for example I have this in one chat...\nMessage 1\nPhoto 1\nMessage 2\nPhoto 2\nPhoto 3\nMessage 3\nPhoto 4\nI want to be able to forward those messages and photos in that sequence to another chat.\nHowever, what inevitably happens is that all the messages go through first... in the right order:\nMessage 1\nMessage 2\nMessage 3\nFollowed by all the photos... jumbled up:\nPhoto 4\nPhoto 2\nPhoto 1\nPhoto 3\nThis is my first time contacting customer support and I found it utterly soul destroying.\nFirst they sent a standard response that didn't answer my question, just telling me how to forward messages generally. Then there was the genius idea of restarting my phone... you know when they tell you to restart your device they've got nothing.\nWhen I persevered they told me they weren't able to understand me. English is my first language and I think my writing skills are good but I was told to try to be AS CLEAR AS POSSIBLE.\nFinally, they sent a very vague response which didn't specifically refer to my question... there's no personalisation... but referred to the \"intended functionality\". I asked them to confirm it wasn't possible to do what I was asking but I got a quite frankly rude reply saying I'd already received an answer... and then no further response.\nI don't believe it's their intended functionality. Who INTENDS for people to receive forwarded messages and photos all jumbled up... why would anyone want that? They obviously just don't have a way to do it and don't want to admit it.\nI was shocked by the \"support\" anyway. The company obviously has a horrible image and reputation globally... their questionable (at best) morals are well known. Why would you want to be rude and unhelpful on top of that? They obviously don't care about their customers. The support is completely useless and unapologetically so. It also seems cold and unfriendly to not use names... it's just a faceless \"customer support\".\nIt's obvious why I use WhatsApp... because everyone does... but I absolutely hate the company and what they stand for and I'm even more clear now about the contempt they have for their customers. There's something in the media about WhatsApp maybe moving out of the UK if some new online safety laws are passed. I wouldn't mind. I would find some way to adapt as I'm sure everyone would.","Heading":"Horrible horrible customer \"support\"","Rating":1,"Location":"GB"}
{"Date":"2020-09-10","Author":"oyama Siphula","Body":"Cant get my backed up chats . I do back ups regularly and it always come successfully. When baught a new phone , I use same emails , number and username . No previous information could be found.","Heading":"Cant get my backed up chats","Rating":2,"Location":"ZA"}
{"Date":"2023-10-26","Author":"小飛","Body":"cannot use video chat well. need fix","Heading":"cannot use video chat well","Rating":3,"Location":"HK"}
{"Date":"2014-03-06","Author":"Azfar Khoja","Body":"I am using whatsapp from last 2 years and I am really happy with this service, its really help me to communicate with my friends and family members, very much re-commanded, will always wish to use this service, EVER & EVER","Heading":"Awesome message service ever used in my life","Rating":5,"Location":"IN"}
{"Date":"2023-07-21","Author":"Imran Riaz","Body":"Very usefull app to contact of friends and family","Heading":"Very usefull app to contact of friends…","Rating":5,"Location":"PK"}
{"Date":"2024-02-10","Author":"Iconic Fotos","Body":"This used to be amazing and now it's rubbish. Can't upload multiple photos. Anyone suggest a better app?","Heading":"This used to be amazing and now it's…","Rating":1,"Location":"ES"}
{"Date":"2023-02-02","Author":"James Moore","Body":"Me running my business on whatsApp as a TV and ppl messaging me for advertisement of their respective products, since they're too many of them to post with a time frame on it for each person's advert to go down I will schedule dem so I don't forget. Please whatsApp do something this..","Heading":"Me running my business on whatsApp as a…","Rating":2,"Location":"NG"}
{"Date":"2021-01-12","Author":"Uriyel Dill","Body":"Poor service","Heading":"Ban WhatsApp","Rating":1,"Location":"ZA"}
{"Date":"2022-11-28","Author":"Emihle Londwe","Body":"Three days now my whatsApp is not working","Heading":"Three days now my whatsApp is not…I even tryed downloading the other versions but still","Rating":1,"Location":"ZA"}
{"Date":"2020-08-31","Author":"Savaiola","Body":"Comparing WhatsApp to the others\nIt the best that has many options \nEasy one for texting \nTransfers voice successfully without any problems","Heading":"Comparing WhatsApp to the others","Rating":4,"Location":"AU"}
{"Date":"2023-04-03","Author":"Simal Sethi","Body":"It is good while the going is good. But, if you face any issues…then only GOD can help u for certainly their support will not.","Heading":"Very poor customer service\/ help","Rating":2,"Location":"IN"}
{"Date":"2020-10-01","Author":"Sinead Banfield","Body":"Amazing that I can contact family and friends around the world for free 😊 it's changed my life!","Heading":"Amazing that I can contact family and…","Rating":5,"Location":"GB"}
{"Date":"2024-02-05","Author":"ניקולאי אין","Body":"Everything was fine and i am using it for years on my personal account, but my business number used for months for clients support and sales is suddenly permanently banned for no obvious reason! Not received any response from support except bot message, worst experience ever, very frustrating, i have decided to quit using this for my business even if this costs me leads and i will recommend anyone to stay away! they are unreliable in my opinion","Heading":"Everything was fine and i am using it…","Rating":1,"Location":"IL"}
{"Date":"2021-03-14","Author":"Constantina Constantinou ","Body":"Fallen victim to fraud on WhatsApp and they blocked my account. Contacted their support for help multiple times but haven’t heard back and it’s been a month now. Worst customer experience I’ve ever had!!!!","Heading":"Fallen victim to fraud on WhatsApp and…","Rating":1,"Location":"GR"}
{"Date":"2023-05-12","Author":"Keabetswe Mokoena","Body":"I have a great experience with whatsapp...but sometimes it takes a time to receive the messages","Heading":"I have a great experience with…","Rating":4,"Location":"ZA"}
{"Date":"2023-03-19","Author":"Renzo Schauwecker","Body":"This review focuses only on the customer service.\nWhatsapp has become a necessary evil. This means that although many of us would like to try an alternative app, convincing all your contacts to move to another app would be quite difficult or impossible. It is a tad like Microsoft, that although there might be much better products out there, we just got used and dependent on it \/ them. These companies know about this and that is the reason why they don't really need to spend a lot or any resources on providing a true customer service. They know you would stick to using them, no matter what. These are the terms and conditions and that's it. They don't really care about you \/ us.\nHaving said that, this review focuses on one particular experience. My data.\nI have never been very fond of creating backups in the \"cloud\" and I agree I am quite old school, creating backups on my PC. The reason might be the same as why I am writing this review. I want to have access to my information and data and not be subject to yet another provider's terms and conditions.\nThe PC backups I created on my PC can not be accessed anymore, after my mobile phone died. They are encrypted and there is apparently no way to restore or access them. Tried different alternatives and just because I don't go with the flow of allowing my data to be stored somewhere else, I can not access my data. Feels like data ransom to me. Anyway, I just got used to the idea of having lost all my historical information with no one to help me.\nThis does not even mention, what whatsapp \/ facebook might actually doing with my data on the first place, but the fact that I can not even access it, is just somehow astonishing.\nAs some users have mentioned, it used to be a great app, until it was acquired by Meta \/ FB.\nHoping you are not experiencing such a frustrating experience.","Heading":"Customer Service non existent","Rating":1,"Location":"DE"}
{"Date":"2019-11-18","Author":"Haliza Hamid","Body":"Whatsapp is great social media platform though. But I hope you put the dark mode.","Heading":"Whatsapp is great social media platform…","Rating":4,"Location":"MY"}
{"Date":"2021-12-17","Author":"steve na","Body":"this app is full of fake people who will scam u for money iv had them try to do it to me. im much smarter then they will ever be dont ever send money on this site to anyone fyi.","Heading":"this app is full of fake people who…","Rating":1,"Location":"US"}
{"Date":"2021-05-16","Author":"Pindad Darko","Body":"This app always bans any number I use in registering WhatsApp anytime I create a group and add some few persons there. Immediately I create and add people to my group, I get banned within few seconds. Really annoying and frustrating.","Heading":"This app always bans any number I use…","Rating":1,"Location":"GH"}
{"Date":"2020-04-28","Author":"My post ","Body":"Im not sure if i have been hacked.. Talking about a profile for something and said they will pick the black panther avatar for me as i like that... Then 2 hours later... While playing call of duty... Im invited to join a regiment, guess the name?\n\nThe black panter, very coincidental? Or what","Heading":"Im not sure if i have been hacked.","Rating":1,"Location":"GB"}
{"Date":"2023-05-11","Author":"Disillusioned","Body":"Support is now just a broken bot. A complete waste of time asking for help with a WIN 10 desktop issue and being advised how to fix a damn MAC.\nUpdate: I tried two more times to get some sense from their broken bot but the inference is that Signal and Telegram are good viable altrnatives","Heading":"Support is now just a broken bot","Rating":1,"Location":"SE"}
{"Date":"2023-08-25","Author":"Eric Mann","Body":"WhatsApp support is rubbish - run by bots. I wanted to know how a creator of a group could pass on the group without disbanding it and WhatsApp replied “if you want to delete a group…” total rubbish","Heading":"WhatsApp support is rubbish","Rating":1,"Location":"GB"}
{"Date":"2020-05-27","Author":"Pyjama Bear","Body":"There's absolutely no security. I could log into my account from another device without even entering a password. Anyone borrowing your phone for a second can scan a QR code and have permanent access to your account!","Heading":"There's absolutely no security!","Rating":1,"Location":"SE"}
{"Date":"2023-09-17","Author":"Steve Jones","Body":"It's rubbish. Don't bother","Heading":"It's rubbish","Rating":1,"Location":"GB"}
{"Date":"2021-01-12","Author":"Ngoc Yen Banh","Body":"Closed my accounts. Not going to use a service that suppresses free speech. New terms and conditions are for communism","Heading":"Closed my accounts","Rating":1,"Location":"AU"}
{"Date":"2016-05-26","Author":"Claire","Body":"Indespensable in my routine. Recently it has been crashing loads of times on my phone, but still the best messaging app out there.","Heading":"Wouldn't know how could I do without it!","Rating":5,"Location":"GB"}
{"Date":"2022-04-17","Author":"John Bortolin","Body":"Manipulative cubicle dweebs, like so many of that generation .across all online platforms One worst than the next Begging for some type of recognition.Horrible service","Heading":"Manipulate cubicle dweebs","Rating":1,"Location":"CA"}
{"Date":"2021-01-27","Author":"Manoj Nayak","Body":"Whatsapp is the best software application. In  messanging application. We can use this software very easily and comfortable. but it's privacy policy are not suitable for users","Heading":"I am a user it was easy to use","Rating":3,"Location":"IN"}
{"Date":"2020-10-10","Author":"Sagar","Body":"Our number was passed along to pornograhic websites. What took place was gross invasion of privacy, sexual harassment and mental torture. We made a complaint to the customer service and they laughed at us. No one should be on this app.","Heading":"Invasion of privacy and harassment","Rating":1,"Location":"IN"}
{"Date":"2021-11-03","Author":"Olayinka","Body":"I have had and still have this Scammer on my page always begging me for money. I filled the WhatsApp instruction to block,nothing happened. This Scammer completely plagued my life, I planned to quit my Whatsapp group.\nI enjoy my group in whatsapp it will be a pain to quit.\nReading through other review, I discovered that other people are complaining mostly about the same problem and taking similar whatsapp measures that never work.","Heading":"WHATSPP DOES NOT ACT ON COMPLAINTS.","Rating":2,"Location":"GB"}
{"Date":"2013-04-20","Author":"Hunny Kaushal","Body":"I love to use whatsapp but i rarely use it because i dont have internet connection on my phone, i rarely use it by using someone's wi fi","Heading":"whatsapp is great app for phones","Rating":5,"Location":"IN"}
{"Date":"2021-10-04","Author":"chaosgirl Minecraft","Body":"It doesn't work it's a bad app I don't like it","Heading":"It doesn't work it's a bad app I don't…","Rating":1,"Location":"DE"}
{"Date":"2021-02-11","Author":"H K","Body":"Worst customer support on the planet!!\n\nYou ask for help and they reply back with an answer that is irrelevant to the question.  \n\nWorst still when you reply back they in turn  reply back with a different answer that is again irrelevant.\n\nThe issues remains unresolved because they will not give any help.","Heading":"Worst customer support on the planet!!","Rating":1,"Location":"GB"}
{"Date":"2020-09-09","Author":"Shabeermon M","Body":"Hope whatsapp will start the live video streaming over mobile platform in groups..Can't wait...","Heading":"Hope whatsapp will start the live video…","Rating":5,"Location":"IN"}
{"Date":"2022-02-22","Author":"PPL","Body":"I sent the following message to WhatsApp -\nHad Whatsapp Web loaded on my iPad but having problems - deleted and reloaded Set up QR scanner on my iPhone but every time I scan the code from my iPad it recognises the code but fails to reload.\nThe app was working fine previously, but after many attempts, deleting\/reloading on my iPad, cannot get the app to work.\nWhatsapp on my iPhone has no problems, but why can’t I load on my iPad - it worked previously?\nWould appreciate your advice on solving.\nThanks\n\nWhatsApp respond with the same auto response, do not answer to provide a solution and ask to complete a customer questionnaire!!!!\nEven when I resubmit I get the same response.\nWaste of time.\n\nAnother three attempts with the same results - ask any questions and get same response!!!!","Heading":"Never answer the question!!!!!","Rating":1,"Location":"GB"}
{"Date":"2020-09-16","Author":"Aatif Shaikh","Body":"Everything about his is great, just a little work on call quality would be ideal","Heading":"Everything about his is great","Rating":5,"Location":"US"}
{"Date":"2020-07-12","Author":"Mike Dennison","Body":"Recently implemented the business WhatsApp and its increased engagement rates","Heading":"Recently implemented the business…","Rating":4,"Location":"GB"}
{"Date":"2021-07-19","Author":"Pedpost Urgent Care","Body":"I hate it that you cant leave a group without people knowing. I really hate whatsapp.","Heading":"I hate it that you cant leave a group…","Rating":1,"Location":"US"}
{"Date":"2020-05-26","Author":"David A","Body":"Either they use chatbots or have the dumbest staff in the world. I have given up trying to set up Whatsapp for business. So disappointing.","Heading":"Either they use chatbots or have the…","Rating":1,"Location":"AU"}
{"Date":"2024-04-24","Author":"Nyinomugish A","Body":"I now believe whatsapp is fully operated by robots and virtual assistants. Mi phone company went bust so that number was suddenly not receiving any calls or sms. I first thought it was mi phone so I uninstalled all apps and when I reinstalled, I couldn't receive the code to verify the number. I kept telling them I am willing to send documents to prove its mi number but they never reply apart from sending me to their faq!\nI have all mi contacts in mi account and now I can't assess nothing! Could a human being please get back to me?","Heading":"Whatsapp service not helpful","Rating":1,"Location":"GB"}
{"Date":"2023-04-23","Author":"Utas","Body":"As other people say too, WhatsApp has no support team but only bots that can't understand any context, or this people can't understand English and just try to guess where I want them to help me.\nIf this wouldn't be so serious, you could maybe laugh about the person that  thought:\n\"Hmm...🤔No support team for a service that has over 3 Billion users?\nYes😎.\"\n\nEven though a (human!!!) support team is expensive, its absolutely necessary if you are as big as WhatsApp because some things won't work as expected and FAQs are sometimes just useless...\n\nPS: My request number is #611452944369194, you could still help me, and I would probably stay on WhatsApp...","Heading":"Support?  ...of course not🫠","Rating":1,"Location":"ZA"}
{"Date":"2024-05-27","Author":"Kaat","Body":"Hey i have issues with my whatsapp account, i keep getting the message ‘you can no longer use whatsapp’ and after i appeal i get the message that my account has been restored. Soon after the problem returns.. how can i fix this? How can i reach whatsapp? Can anyone help me?","Heading":"Hey i have issues with my whatsapp…","Rating":2,"Location":"BE"}
{"Date":"2020-11-03","Author":"nozhan frouzandeh","Body":"worst app ever... \n1-you must be in the chat to listen to a voice and when exiting the chat voice would stop.\n2-when I remove a massage means I didn't want to be seen, then WhatsApp inform that I have removed it...\n3-i want to edit my text, is that so hard to add?\n4-what about showing how much size is downloaded and uploaded of each file so that we know how long we should wait????\n5-for WhatsApp windows: YES I am connected to my phone, YES...YES...YES","Heading":"worst app ever..","Rating":1,"Location":"US"}
{"Date":"2023-04-02","Author":"Big Family","Body":"Absolutely brilliant. \n\nA fantastic tool for family and business.","Heading":"ABSOLUTELY BRILLIANT","Rating":5,"Location":"GB"}
{"Date":"2021-10-19","Author":"Maisie Tee","Body":"Leaving this app has been an ongoing disaster. I was told I'd successfully deleted my account 3 weeks ago, but my friends are still now asking why I'm ignoring their WhatsApp messages. I've put a lot of time, effort and screenshots from friends describing my issue very clearly to the WhatsApp help desk, but it's like talking to an AI. They'll give me brief conclusions to completely separate issues. No matter how clearly I explain the problem they're unable to understand, or simply not bothered. I expect the latter, as I've described it so that a child would understand, and said if it's still unclear I'm happy to talk over the phone. It's still unresolved.","Heading":"Help Centre don't read my messages\/don't care","Rating":1,"Location":"GB"}
{"Date":"2023-12-30","Author":"Ahmed Awadallah","Body":"En\n\n‏If you want to lose your data, your chat archive, and all your memories suddenly, without warning. All you have to do is use the WhatsApp program...they canceled and deleted my account and the accounts of dozens of friends without reason or notice. This program also clearly stands on the side of the Zionists who kill women and children and does not respond to objection messages. This is the same policy followed in the occupied territories.\n\nFr\n\nSi vous souhaitez perdre vos données, vos archives de discussion et tous vos souvenirs soudainement, sans avertissement. Tout ce que vous avez à faire est d'utiliser le programme WhatsApp... ils ont annulé et supprimé mon compte et les comptes de dizaines d'amis sans raison ni préavis. Ce programme se tient également clairement du côté des sionistes qui tuent des femmes et des enfants et ne le fait pas. répondre aux messages d’objection. C’est la même politique suivie dans les territoires occupés.\n\nEsp\n\n‏Si quieres perder tus datos, tu archivo de chat y todos tus recuerdos de repente, sin previo aviso. Todo lo que tienes que hacer es usar el programa WhatsApp... cancelaron y eliminaron mi cuenta y las cuentas de docenas de amigos sin motivo ni previo aviso. Este programa también está claramente del lado de los sionistas que matan a mujeres y niños y no responder a los mensajes de objeción. Ésta es la misma política que se sigue en los territorios ocupados.\n\nاذا اردت ان تفقد بياناتك وأرشيف محادثاتك وكل ذكرياتك فجاه دون سابق انذار. فما عليك سوى استخدام برنامج الواتساب …قاموا بإلغاء وشطب حسابي وحسابات عشرات الأصدقاء دون سبب او اشعار كذلك هذا البرنامج وبشكل واضح يقف في صف الصهاينة قتلة النساء والاطفال ولا يرد على رسائل الاعتراض وهذه نفس السياسة المتبعة في الاراضي المحتلة","Heading":"Dont trust whatsapp","Rating":1,"Location":"TR"}
{"Date":"2023-10-30","Author":"Tanzeel Abbas","Body":"Easy to use for chatting and video call on low data","Heading":"Easy to use for chatting and video call…","Rating":5,"Location":"PK"}
{"Date":"2020-04-26","Author":"Morino","Body":"Good; it does what it is supposed to.","Heading":"Good","Rating":4,"Location":"SR"}
{"Date":"2023-07-19","Author":"White Paper","Body":"WhatsApp doesn't allow you to schedule messages for an specific day and time. Why? Besides, when you erase a message that action should not leave a trace behind. I would also love WhatsApp to increase the amount of chats you can resend a message. Other thing I would love is to have the option to choose the level of privacy an specific chat gets, for example I don't want to get blue confirmation double check in the chat with my wife, but I do in the chat with my girlfriend 👋","Heading":"WhatsApp doesn't allow you to schedule…","Rating":1,"Location":"VE"}
{"Date":"2020-05-12","Author":"Bogdan Mihai","Body":"Certainly makes life easier.","Heading":"Certainly makes life easier.","Rating":5,"Location":"RO"}
{"Date":"2023-12-28","Author":"ahmed osman","Body":"I changed my number and now it’s a nightmare every time I place a call I get this message saying due to spam I have violated the terms of service and submit a review and wait for 24 hrs I submit wait get the code then again the same thing happens over and over to my knowledge I have not violated any terms of service I rarely post anything I just make  necessary calls which by the are very few","Heading":"I changed my number and now it’s a…","Rating":1,"Location":"KE"}
{"Date":"2022-07-10","Author":"JADB","Body":"It was practically impossible to get an answer to my problem. Despite repeatedly describing my issue all I got were responses copied and pasted from the FAQ site. The worst part is I have still got no idea where to go or whom to ask. It’s like screaming into a void.","Heading":"Completely run by bots","Rating":1,"Location":"GB"}
{"Date":"2017-06-02","Author":"Berenice J","Body":"Very useful, working properly and whatsapp doesn't have a free talk tools!","Heading":"Very useful","Rating":4,"Location":"AU"}
{"Date":"2019-01-09","Author":"Sofia Soulfly","Body":"Not good, not bad, just functional, but a bit heavy.","Heading":"Decent app..","Rating":3,"Location":"UA"}
{"Date":"2021-03-19","Author":"Jason Lin","Body":"It is great app, it helps people to connect with each other instantly.","Heading":"It is great app","Rating":5,"Location":"US"}
{"Date":"2024-01-19","Author":"Carim Ahmed","Body":"Does not work properly Facebook messenger better them WhatsApp","Heading":"Does not work properly Facebook…","Rating":2,"Location":"GB"}
{"Date":"2019-09-09","Author":"Ron","Body":"Poor. Period.No support contact via the App itself ! LOL. Ever wonder WHY Whatsapp wants your phone number, email address and full access to your contact list BEFORE you are able to access any support ?? First Whatsapp insists you do an update, and then demands a current phone number... before dropping all your profile and chat history on your existing account ! Zero option to contact support via App itself - talk about BIG BROTHER demanding all your personal info... to onsell to Fakebook business clients ??? Privacy people, PRIVACY, remember that ?? So much for offering encrypted chat....","Heading":"Extremely Poor","Rating":1,"Location":"AU"}
{"Date":"2022-03-31","Author":"Richard Bennett","Body":"This is not a review of WhatsApp. I rely on the service for communication with my girlfriend who lives in another country to me.\n\nI’m sure most people are aware of scams… but I just wanted to share my experience.\n\nSo I get a message from what appeared to be my son, saying his phone was damaged so was using a new number.\nI was a little suspicious but went along with it for a while.\n\nThen, he said he needed a bill paying as he couldn’t access his account yet.\nNow my son is 9, so this confirmed it was a scam.\n\nIt said ‘of course I have a bank account’ to which I replied ‘9 year olds don’t have bank accounts’\n\nThe scammers then went quiet, of course!… so I blocked and deleted \n\nI’m only completing this review as a way of warning other people!\n\nIf in doubt… block and delete!","Heading":"This is not a review of WhatsApp but a scam warning!","Rating":4,"Location":"GB"}
{"Date":"2023-10-11","Author":"Andre G","Body":"My WhatsApp has been locked for hours and there is no way to unlock it. The SMS and call codes don't work. The issue is that THERE IS NO WAY TO TALK TO ANYONE IN THIS COMPANY. I just receive automated emails that don't address the issue. What kind of customer service is this?","Heading":"Zero attention to my issue","Rating":1,"Location":"CA"}
{"Date":"2023-07-06","Author":"Chris Lee","Body":"Have used WhatsApp for a long time now. No issues. Instead of leaving voicemail like in the old days, leave a text and\/or voice message. Tells you when it is sent with 1 tick, 2 ticks when received, ticks change colour when read. Except when either you or the person you have sent the message to have read receipt turned off.\n\nUse it make international wifi calls to family and friends around the world for free","Heading":"One of the best messaging apps","Rating":5,"Location":"GB"}
{"Date":"2021-02-24","Author":"IPTV Spezialist","Body":"Ich wurde gesperrt und bei 382 Tickets eröffnungen erhalte ich inmer die gleiche antwort die nicht stimmt. Ich soll messenger weiter nutzen können aber business nicht. ok aber es geht teotzdem nicht. Millionen Unternehmen und kein Telefon oder co support.\n\nYour WhatsApp Business account is banned because your activity has violated our Commerce Policy.\n\nPlease review the WhatsApp Business Policy carefully to learn more about the appropriate uses of the WhatsApp Business app and the activities that violate our Terms of Service.\n\nYou may, however, continue using the registered number on the WhatsApp Messenger account for your personal use.\n\nIf we suspect that your business violates our commerce policy, we may not issue a warning before banning your business account. If you believe your activity didn’t violate our policy, please let us know. Make sure to provide details about the specific products and services you deal in on the WhatsApp Business app.\n\nNote: WhatsApp reserves the right to modify, suspend, or terminate service for any reason without prior notice, at our sole discretion.\n\nDiego \nWhatsApp Support Team\n\nTake a look at our Help Center!","Heading":"Ich wurde gesperrt und bei 382 Tickets…","Rating":1,"Location":"DE"}
{"Date":"2021-02-16","Author":"Mrs VW","Body":"AVOID!!!\nThis company sells your number to the third parties!!!  The third parties who are crooks, and I keep getting phone calls  with automated voice from HMRS, National Insurance, Tax Office, etc. all SCAMM!! the calls are threatening there has been an investigation for the tax crime I have commited!!! I had the same experience with Viber, that's why don't have it any longer. But as soon as I uninstalled viber, the phone calls stopped. And with Whatsapp it's a nightmare! I've removed it from my phone 3 weeks ago after the first scam call, and I still keep getting those annoying calls regularly!","Heading":"AVOID!!! They sell your number to SCAMMERS!!!","Rating":1,"Location":"GB"}
{"Date":"2023-01-31","Author":"Peter Ronald","Body":"As someone who runs my business on WhatsApp and people message me for advertisements of their individual items, I'll schedule them so I don't forget because there are too many of them to post with a time period for each person's commercial to go up. Please do something about this WhatsApp.","Heading":"someone that operates my business on WhatsApp and people are messaging me for advertisements of their individual items; because there are too many of them to post with a time period for each person","Rating":3,"Location":"NG"}
{"Date":"2024-02-04","Author":"Luca Abichedid","Body":"I am a person who uses a eye gaze computer to communicate. whatsapp lacks video, audio and voice calls. I always type out my thoughts and for me this is not an application I would use","Heading":"I am a person who uses a eye gaze…","Rating":1,"Location":"US"}
{"Date":"2021-01-10","Author":"Hashim","Body":"The new privacy policies of watsapp is scary. We use the app only since it give much importance to privacy more than any other app. Privacy policy must change other wise we will chose signal for sure. We don't believe Facebook after American election issues. Be cautious with your customers and always remember \"customer is the king\".","Heading":"The new privacy policies of watsapp is…","Rating":1,"Location":"IN"}
{"Date":"2021-05-24","Author":"Mukherjee Enterprises","Body":"Whatsapp is a great platform for communicating with friends and family. It's End to end encription to the chat system makes your chats very safe and secured. Besides, we have been doing our online classes of our students for more than 8 months through whatsapp group. Rather you will be able to share your location, using Google Map within the app in chat inbox features. So, out of all social media sites, Whatsapp is the best for sharing through chats due to it's varieties of unique features!","Heading":"Whatsapp is a great platform for…","Rating":5,"Location":"IN"}
{"Date":"2020-11-10","Author":"customer - Paul Crow","Body":"Ever tried dealing with this mob?Wait 24 hours - doubling every time you don't follow their non-existent rules - they are pathetic. Ask them a question - they IGNORE you - since being taken over by big business - they have introduced customer malaise. What did I do wrong for having to wait a week? Bought a new phone & tried to transfer to it! Naughty me!","Heading":"Ever tried dealing with this mob? 1st wait 24 hours","Rating":1,"Location":"GB"}
{"Date":"2020-04-07","Author":"Priyanshu Awasthi","Body":"Status timing is decreased why before it we have put 30 second status and now onward we have put only 15 seconds status why what is the problem","Heading":"Status timing us decreased why before…","Rating":2,"Location":"IN"}
{"Date":"2018-10-25","Author":"Nasir Ullah","Body":"Hay Whatsapp developer I was thinking about a feature that there should be a lock button during a video call. So if for example someone is on a video call and want to lock the screen like there is in MX player while watching a movie there is a lock option so your screen will be lock for the current window. Same thing while in video call there should be a lock option for video caller to lock the current screen.","Heading":"Lock Button on Whatsapp Video Call","Rating":5,"Location":"PK"}
{"Date":"2020-05-13","Author":"Kehinde Orugun","Body":"A group admin should have total control of the group.\nThe admin should be able to delete messages posted by other members.\n\nThis should be looked into.","Heading":"A group admin should have total control…","Rating":1,"Location":"NG"}
{"Date":"2021-05-26","Author":"Areen O`Mary","Body":"Terrible. I have been trying to to contact customer service for a week! And when I finally got hold of someone, he was incredibly rude and didn't address my questions at all. Terrible service, and horrible application.","Heading":"Terrible","Rating":1,"Location":"US"}
{"Date":"2020-10-15","Author":"Yacine Rabia ","Body":"I hate the new update as all pictures you send are automatically saved to your camera roll and it dont have an option to switch it off","Heading":"Pictures saved to my camera roll👎🏼","Rating":1,"Location":"GB"}
{"Date":"2021-11-24","Author":"Boris","Body":"I continiously receive text messages from Whatsapp with verification codes on my phone.\nI don't have a Whatsapp account and I have no plans to register one.","Heading":"I continiously receive text messages…","Rating":1,"Location":"RU"}
{"Date":"2023-09-12","Author":"Florentia","Body":"WORST CUSTOMER SUPPORT EVER!\n\nThey continuously keep banning my number without a reason. And i keep sending them emails for 1 week and their response is automated. \n\nUnbelievable....","Heading":"WORST CUSTOMER SUPPORT EVER!","Rating":1,"Location":"CY"}
{"Date":"2022-03-26","Author":"Artur Kuropatwinski","Body":"Rubbish can't send music on other devise","Heading":"Rubbish can't send music on other devise","Rating":1,"Location":"GB"}
{"Date":"2024-01-04","Author":"vizZzio group","Body":"Terrible customer service!\nUnable to contact either by phone or email. Just terrible service","Heading":"Terrible customer service!","Rating":1,"Location":"BY"}
{"Date":"2022-02-02","Author":"Robert Plant","Body":"Poor customer service","Heading":"Poor customer service","Rating":1,"Location":"US"}
{"Date":"2020-12-16","Author":"Nikoletta Papadimitriou","Body":"My number one place for communication and quick chats, both on mobile and Pc","Heading":"My number one place for communication…","Rating":5,"Location":"GR"}
{"Date":"2022-02-09","Author":"Mrs Jo Durao","Body":"Absolutely appalling customer service... Copy pasting replies isn't really helpful...","Heading":"Appalling experience","Rating":1,"Location":"GB"}
{"Date":"2023-09-27","Author":"Abiraje Sharma","Body":"End-to-end encryption\nMessages and calls stay between you. No one else can read or listen to them, not even WhatsApp.\nAdditional layers of privacy\nBeyond end-to-end encryption, we add additional layers of protection to all of your conversations.\nControl the privacy you need\nYou get to choose what you share, how you show up online, or who can talk to you.","Heading":"End-to-end encryption","Rating":5,"Location":"AE"}
{"Date":"2021-02-09","Author":"Morag Noname","Body":"Unreal! 1000\/1000\n\nIt’s ideal \n\nEasy \n\nFun\n\nBrings people together \n\n👏👏👏","Heading":"Unreal 10\/10","Rating":5,"Location":"GB"}
{"Date":"2023-11-02","Author":"Skye R. Paige","Body":"With no warning or explanation, WhatsApp banned my number when I tried setting up an account today. I tried contacting WhatsApp several times. Each time, I get a scripted response to contact another department but there is no information to contact that department. This is my first time using WhatsApp and trying to set up my account and number on my new facebook business page.","Heading":"Banned Without Explanation","Rating":1,"Location":"US"}
{"Date":"2021-08-15","Author":"Johnson Charles","Body":"Best communication app ever ! Very easy to use...fast and superb !","Heading":"Best communication app","Rating":4,"Location":"LK"}
{"Date":"2023-12-05","Author":"Reya","Body":"Encuentro en falta la emoticona de un animal tan entrañable cómo la Morsa. \n\nGracias","Heading":"Sigue sin estar la emoticona de la morsa 😭","Rating":4,"Location":"ES"}
{"Date":"2023-10-28","Author":"Bart Poole","Body":"I like it, easy, do the job.","Heading":"I like it","Rating":4,"Location":"US"}
{"Date":"2022-03-30","Author":"customerkosta","Body":"I like the application, it helped me for my company a lot. Unfortunately, a little difficult to use...","Heading":"I like the application","Rating":3,"Location":"GR"}
{"Date":"2021-03-31","Author":"Elaine","Body":"Foreigners from other countries likes to use this app because once they get your phone number they can then take and hack your phone and steal all your information and possibly get into your bank account don’t use this app","Heading":"Foreigners from other countries likes…","Rating":1,"Location":"US"}
{"Date":"2013-10-25","Author":"Philip James Collins","Body":"Whatsapp  has been a great help for me especially as my family live in Hong Kong so calls & SMS' are so expensive from London.","Heading":"Great App","Rating":5,"Location":"GB"}
{"Date":"2018-06-18","Author":"Paul","Body":"I have had a issue with not being able to retrieve my data from Icloud due to the fact I changed my number with Whatsapp.\n\nI have asked the company numerous times for help in resolving this matter all to no avail.\n\nShockingly bad customer service but then what can I expect from a free app ?","Heading":"Terrible Service","Rating":1,"Location":"GB"}
{"Date":"2018-12-30","Author":"A Future","Body":"Been trying to re-active Whatsapp for nearly a week. The re-activation does notwork then it increases the time days at a time. The call me button is not worth being there and the support is crap. There is no option to restore a backup from an iphone to android. The application is basically useless!\n\nThey need to improve the switching from an iphone to android.\nImprove the activation process because its rubbish\nHave better support\nBe more customer friendly\n\nWhatsApp - Whats not working? ...the APP!","Heading":"Been trying to re-active Whatsapp for…","Rating":1,"Location":"GB"}
{"Date":"2020-05-23","Author":"Mafalda Simkins","Body":"When ever I have an urgent call to make it BEVER EVER WORKS \nWHEN I GO UNDER MY RECENT CALLS IT SHOWS THE 20 CALLS  were all cancelled when it was ringing on my end until disconnect the person my mother that I was friend to reach overseas because my father died end result was not able to reach her awful disturbing disappointment !!!!\nTo say the least being on WiFi and having cellular data turned on for what’s app how on earth is it still not going through ??????? Covid-19 PLEASE","Heading":"When ever I have an urgent call to make…disturbing","Rating":1,"Location":"US"}
{"Date":"2019-07-04","Author":"Daramola Babawale Gideon","Body":"WhatsApp is extremely good making usage easy even to newbies,just that video upload was bad yesterday","Heading":"WhatsApp is extremely good making usage easy","Rating":3,"Location":"NG"}
{"Date":"2023-08-26","Author":"Atom Gaming","Body":"Worst automated support ever!!","Heading":"Worst automated support ever!!","Rating":1,"Location":"IN"}
{"Date":"2023-08-12","Author":"Bilal Record","Body":"This is amazing site. I have a great experience with this app.","Heading":"This is amazing site","Rating":1,"Location":"PK"}
{"Date":"2019-04-10","Author":"denise halbert","Body":"Hopeless no use if you can't use it on all devices WhatsApp whats the point","Heading":"Hopeless no use if you can't use it on…","Rating":1,"Location":"GB"}
{"Date":"2018-10-30","Author":"Rohit kashyap","Body":"actually whatsapp before is very good Service But Now is very boring like video sending problem and massage forward time is creat a problem  i think 2 star is best rinking","Heading":"is boring","Rating":2,"Location":"IN"}
{"Date":"2020-05-20","Author":"PoeticConder","Body":"In terms of communication and passing messages Whatsapp has greatly helped most people to pass and receive messages including audio, photos and videos. There security encryption is very reliable","Heading":"In terms of communication and passing…","Rating":4,"Location":"KE"}
{"Date":"2021-01-08","Author":"Hassan ali","Body":"Was good app but the new privacy rules are a big no. Will be shifting to telegram","Heading":"Was good app but the new privacy rules…","Rating":2,"Location":"PK"}
{"Date":"2020-02-24","Author":"tim","Body":"Terrible customer service. I think I have sent at least 5 emails to their help department in the last week and haven't had a single reply.","Heading":"Terrible customer service","Rating":1,"Location":"GB"}
{"Date":"2020-06-22","Author":"Vito Celia","Body":"Great app! very easy usable","Heading":"Great app","Rating":4,"Location":"IT"}
{"Date":"2024-05-04","Author":"CM","Body":"Problems with transferring WA account to new phone number: \nThey do not help at all! There is no actual support!  WA just keeps on sending automated general messages. \n\nI have described the exact problems - but they say \"no problem\" and then they keep sending these general messages that do in no way help me! (and by the way - they can clearly see the old phone number ! Meaning it has NOT been changed) \nI have tried contacting them several times and I keep getting same automated general messages. \nThey have clearly not red the messages and they have never tried to actually SOLVE the problems nor tell me what to do with that problem. \n\nI have never ever experienced such lousy support! It is beyond the lowest of low targets!","Heading":" WhatsApp.com support is beyond the lowest of low targets","Rating":1,"Location":"DK"}
{"Date":"2020-04-15","Author":"James Foster","Body":"A much better method of messaging than simple text. The easy format of conversation history and ability to send photos and videos without extra cost sets Whatsapp apart from text.","Heading":"A much better method of messaging than text","Rating":4,"Location":"GB"}
{"Date":"2020-08-25","Author":"Joel Pelkonen","Body":"Impossible to recover an old account if your old SIM card is lost. Ridiculous.","Heading":"Impossible to recover an old account if…","Rating":1,"Location":"FI"}
{"Date":"2023-04-04","Author":"Gene Marhovich","Body":"When did whatsapp become so lame:\/ Have you guys given up altogether?","Heading":"When did whatsapp become so lame:\/ Have…","Rating":1,"Location":"PL"}
{"Date":"2020-11-21","Author":"Kate Fletcher","Body":"Best app ever","Heading":"Best app ever","Rating":5,"Location":"GB"}
{"Date":"2023-03-04","Author":"Chris N","Body":"Difficult to use, can't even add a number. Deletes old chats when signing from another phone","Heading":"Difficult to use","Rating":2,"Location":"GB"}
{"Date":"2022-01-12","Author":"Life-Slice","Body":"Even the actual people you can talk to are about as usefull as their chatbot, remarkable how crappy their support system is and how little you have to know to work there.","Heading":"I'd complain, but why even bother","Rating":1,"Location":"NL"}
{"Date":"2022-02-03","Author":"Iria","Body":"Their customer service is akin to a bot made by a 12 year old. I believe at no point in the 30 emails I sent them was read an actual human adult, nor was any of the response I received (when I received a response at all) was useful or applicable to my problem in any way. Try to understand this, out of 30 emails, none of the response was related to my issue. I don't even know how that is possible","Heading":"Absolutely the worst","Rating":1,"Location":"MY"}
{"Date":"2021-01-20","Author":"Danyola 66","Body":"First of all I have to say one thing amd its one thing! no one has rights to bribe or black mail me or my family since. Whatsapp has sent a threat saying this to my friends and my dad cos they have the recent mobile phones . Whats app has asked them to accept if they don't! whatsapp will share their own information on facebook which is dangerous, wrong and fraud thing to do !,which is also illegal. But they accepted it but Whatsapp should be smart which we are smarter than the team for not using common sense instead they threat  their clients for what? and its really dangerous and this is not just me even my uncle had the same problem  And the workers for them are not working hard enough. And also whatsapp have a habbit off  listen to private calls which is not good sharing other peoples information is none of their buisness. Please can U stop this nonsense since I have the right to report this and make it a big issue whatsapp its not fair on others that u can share personal information on facebook and i take that as a threat I am not happy with this and I want this to be fixed now!.","Heading":"First of all I have to say one thing…","Rating":1,"Location":"GB"}
{"Date":"2019-07-17","Author":"Adrian Maya","Body":"it's always backing up every time and it's not secured, it's very easy to spy on, i was hacked for almost a year by an unknown number, he had  access to my private and financial info.... i lost a lot and i was down thanks to the hacker i met online through what's app again,his number is +19089567882 he was snooping around and i told him what i just went through, he secured my future... you guys should protect us not expose us.","Heading":"security","Rating":2,"Location":"US"}
{"Date":"2017-10-20","Author":"Syed Affan Raza Salman Kaskar","Body":"Best communication app","Heading":"Excellent","Rating":5,"Location":"PK"}
{"Date":"2019-09-02","Author":"Brian Boitano","Body":"through my many years of saving maidens, defeating evil, and tearing up the ice with my blindfolded Triple Lutz, I, Brian Boitano, have accumulated many, many friends. Heck, if I, Brian Boitano, turned up in your town and defeated the Evil Robot King, you would want to be my friend too! Just kidding, you want to be my friend anyway, I get it!\n\nI used to write over 1000 letters daily to keep up with my extensive correspondence. Then last week, I came in to possession of a so-called \"smartphone\" and discovered the wonderful World of Whatsapp. Now I can have all of my many, many friends in one giant group chat where we can talk about my heroic exploits\/appearance all day uninterrupted by the incompetence of postmasters.\n\nWhen it comes to speaking to your many, many friends, there is no easier way for me, Brian Boitano, to do it than using Whatsapp. This is me, Brian Boitano, saying what's up Whatsapp?!","Heading":"I Have Too Many Friends - Brian Boitano, Ice Skater, Hero, Friend-Haver","Rating":5,"Location":"GB"}
{"Date":"2020-04-16","Author":"Ali Golshan Noor","Body":"The app banned me for no reason, and I have sent over 10 emails telling them they banned me by mistake in the last 40 days, and there is no support team actually exist there. \nThey respond with automated messages and not respect the customer. \n\nI'm so frustrated with job and family connections lost there and I have no connection with them.\n\nI hope this won't happen to you.","Heading":"The app banned me for no reason and no support","Rating":1,"Location":"US"}
{"Date":"2021-01-10","Author":"Iaaniya Mitra Khan","Body":"This app was fine, but their new privacy policy is scary and intruding. No respect for user data or the users at all. the new privacy policy will track what business you go in contact into, what you buy when you log in log out how much you stay logged in and potentially even your contacts. All that info is going to be share with fb so that it can be sold. the new privacy policy is really very scary and sets a precedent that violate everyone's right to privacy. everyone that has at least a little of sense and respect for one self should move to signal or telegram. tell your family and friends about it and get the hell out of this app.","Heading":"This app was fine, but their new privacy…","Rating":1,"Location":"PK"}
{"Date":"2023-07-13","Author":"Fiona","Body":"Criminals breed using Whatsapp and there is NO support when you are a victim of crime trying to report it or you are dealing with humans who are so robotic with cut and paste answers and when scammers have sent 5 messagers via whats app the response... we cant seem to find that number. DONT WASTE YOUR TIME. Accept the poor score on trustpilot. We cant all be wrong ! For calls and texts its great.For reporting crime dont bother they dont listen or act.","Heading":"Criminals operate via whatsapp and they do nothing!","Rating":1,"Location":"GB"}
{"Date":"2024-04-12","Author":"Not happy guy Davies","Body":"Run by rapist and peado's they are allowing your kids to see unsuitable content boycott this app ","Heading":"Run by rapist and peado's they are…","Rating":1,"Location":"GB"}
{"Date":"2022-06-18","Author":"Jim B","Body":"I bought a new phone and tried to move my WhatsApp accout to it following the guidance in their FAQ.  The process described in the FAQ did not actually exist in reality.  As a result, my two year history of chats, contacts, and content was deleted from everywhere except the local backup file I had.  However, there does not seem to be a way to retrieve the WhatsApp created backup file in the WhatsApp application.  The robot in charge of support repeatedly asks me to replicate the problem and send them a log.  This closes out the existing ticket with no further effort on their part.  Doesn't solve anything but it's a closed ticket.  No sign of any human in the loop at any time.","Heading":"Backup file destroyed","Rating":1,"Location":"US"}
{"Date":"2022-07-23","Author":"Suzanne King","Body":"WhatsApp has allowed our international team of volunteers to be able to communicate.  While we represent a multitude of time zones and languages, this single app has helped bring us together, and we, as a non-profit, appreciate that we can use it free of charge.","Heading":"WhatsApp has allowed our international…","Rating":5,"Location":"US"}
{"Date":"2022-08-25","Author":"Mainland Kid","Body":"whatsapp is a very great app helped in alot of international communications,i love it,helped make international communication less costly and i give them kudos for that but please they should remove the message timer update,it is going to break alot of home,it promotes cheating spouse alot.","Heading":"the bess cummunicator","Rating":5,"Location":"NG"}
{"Date":"2023-11-30","Author":"Shoshana Bolel","Body":"Very very full of bugs. Desktop app is terrible","Heading":"Very very full of bugs","Rating":1,"Location":"GB"}
{"Date":"2019-05-04","Author":"M Kulu","Body":"It does allow me stop all the incoming calls rejecting a call means other person gets offended","Heading":"It does allow me stop all the incoming…","Rating":2,"Location":"IN"}
{"Date":"2020-07-30","Author":"Angella Noriega","Body":"A very usefull app.","Heading":"A very usefull app.","Rating":5,"Location":"US"}
{"Date":"2020-09-03","Author":"The Lanka Tech","Body":"super hit s power nice help intertsrest best benfit dedfsd bnvfsdfsfg gfgkd vfsfdgjh bjgdf fssed ggahjg hgyut gjhfgec gttgdv jhjyrtxc fereyr jghytrc sdteggh ghfghdd hfhggfd hghdd fgd mgjhty gfdfssw yvnt jghgf ffgd hgh thankyou","Heading":"super hit s power nice help intertsrest…","Rating":5,"Location":"LK"}
{"Date":"2021-02-15","Author":"Rebecca Martin","Body":"this is a horrible app. I have no clue why people like it. the only reason I downloaded it is because the people I wanted to communicate with use this as their only platform. it's stupid. definitely not pc friendly. I cannot stress how stupid this app is and how many hours i've wasted trying to figure out how to get a damn video chat going on my laptop. not to mention how I risked gtting viruses. I am using my 6 year old's laptop to download an emulator so she can talk to her friend who moved to Italy. If her computer gets a virus from this I am going to tell her it is the fault of Whatsapp and facebook for making it so hard for a little kid to talk to her best friend who moved. You should cut out the middle man (emulator). I really want to know the thought process of whoever thought it was a good idea to make this an app but only have video and voice compatibilities on mobile. Please please please explain this because I am trying to put theories together on why it wasn't made possible. So again all I can think of is this is stupid. Why are there so many downloads of this stupid app? What am I missing? What is the appeal? I put all other communicative apps above this one. My expereince has been awful. Hopefully I am able to download an emulator and I don't get a virus on this laptop. And I hope it works so my daughter can videochat her little friend and that way she doesn't go to bed every night crying herself to sleep.","Heading":"this is a horrible app and I hope my pc doesn't get a virus","Rating":1,"Location":"US"}
{"Date":"2021-11-26","Author":"Adrian Bruder","Body":"Absolute rubbish customer services. I had a problem with a broadcast list on the desktop version and they kept telling me they don't \"understand\" the issue...millions other did though on the forums. Absolute and typical USA un-educated customer services.","Heading":"Absolute rubbish customer services","Rating":1,"Location":"GB"}
{"Date":"2020-10-15","Author":"Bidelia Teague","Body":"Overall, it's a great app to stay connected with friends. Can share the real world in the real time. Really very nice app! Loved It... its filters are the best. I recommend everyone.","Heading":"Overall","Rating":5,"Location":"IE"}
{"Date":"2022-01-21","Author":"Michael O","Body":"Truly one of the worst experiences of customer service experiences I've ever had. Too detailed to go into and can't be bothered as it would be a complete waste of time. Martin in particular needs an award as totally incompetent and devoid of any semblance of desiring to help you. Wrote to the CEO as a hope of getting issue to resolve, but of course ignored. Migrating to Signal and encouraging everyone else to do so","Heading":"Worst \"Service\" I've ever experienced","Rating":1,"Location":"GB"}
{"Date":"2024-05-18","Author":"Patrick","Body":"WhatsApp itself is very user-friendly and easy to use, but their support is greatly lacking. I tried contacting them about setting up a new account, and they\/something just continued to respond with pre-generated messages. We went in circles and never reached a solution. Can't believe a company like WhatsApp would have no readily available human support.","Heading":"User friendly, but awful support experience...","Rating":2,"Location":"IE"}
{"Date":"2024-05-18","Author":"Nicoleta Neagu","Body":"It stopped working. \nWhat’s the purpose of this app??!!!","Heading":"It stopped working","Rating":1,"Location":"DK"}
{"Date":"2023-06-11","Author":"Neil","Body":"Yet again I've received the following warning from Tripadvisor after I completed my review and I can't get passed the warning to post my review.\n'I certify that this review is based on my own experience and is my genuine opinion of this restaurant, and that I have no personal or business relationship with this establishment, and have not been offered any incentive or payment originating from the establishment to write this review. I understand that Tripadvisor has a zero-tolerance policy on fake reviews.Learn more about the consequences of review fraud'. \nI am a long standing contributor to TripAdvisor with 106 reviews and now they won't let me post a review. What has happened to TripAdvisor???","Heading":"Waste of Time","Rating":1,"Location":"GB"}
{"Date":"2021-10-04","Author":"RSB","Body":"We have been trying for weeks to sort out an issue with their customer service team, no one reads our emails and all they do is cut and paste irrelevant instructions.","Heading":"Very poor service","Rating":1,"Location":"GB"}
{"Date":"2020-07-30","Author":"wykaaa","Body":"Interface nulle ne respectant pas les standards d'ergonomie. Apparaît comme une application très amateure.","Heading":"Interface nulle ne respectant pas les…","Rating":1,"Location":"FR"}
{"Date":"2023-12-15","Author":"Mauricio Andrade","Body":"I changed my SIM from one mobile to a new one, the account was banned. Nothing whatsoever was done against their policies. I appealed in the app a few times, no response, the ban was kept. I went to the mobile operator and got a new number, they still kept banning the account. Unbelievably dumb service, that's what you can expect from whatsapp company. I understand that being a free service means you can't expect much support. But the company in question should not state there is support for free users when there's none, that's a plain lie. Lying companies should be held accountable for their practices.\n\nUpdate: I ended up finding a customer support email - android \"at\" support \"dot\" whatsapp \"dot\" com - and sent an email explaining the problem, apparently they have another one for iphone users as well. Whatsapp replied two days after and they removed the ban and I was able to register the number and start to use the app normally again. I change the rating to 3 starts because they should make the customer support email easily available, but instead I had to search it for hours.","Heading":"Banned when I changed mobile phone","Rating":3,"Location":"CH"}
{"Date":"2023-02-05","Author":"Lidia Andersen","Body":"Since the program became part of Facebook, it has been losing quality.\nI used the program on my phone and computer. Last month, I discovered synchronization errors - that not all the chats that I had on the phone are displayed on the computer. I wrote ticket to support. I began to receive inappropriate and inadequate answers. There were about 8 letters by email and about 4 by the support option in the phone, I attached screenshots.\nEach time they advise something completely inappropriate, as if they didn’t read the messages at all, they ask you to describe the problem (again and again !!!) and repeat the same thing again, tell some program functions, like an encyclopedia. Then, they just closed the chat without any reason and without solving the ticket.  It was the worst communication with support in my life, I would say - no communication. Most likely, a robot writes there and you will never get a normal answer, they don’t give a damn about your problems. Their software deteriorates, constant failures, but no one is in a hurry to fix and help. \nSo, I think WhatsApp is becoming dead, you need to change the messenger.","Heading":"Really terrible customer service","Rating":1,"Location":"RU"}
{"Date":"2022-07-05","Author":"Fred","Body":"The app was functioning very well till about Feb of 2022.  I noticed that my group calls lately don't work at all.  Also, the app doesn't update automatically on Android.","Heading":"Used to be a good app...","Rating":2,"Location":"US"}
{"Date":"2020-12-31","Author":"AdamSan8","Body":"I like this App, I like the ease of communication.","Heading":"I like this App","Rating":4,"Location":"US"}
{"Date":"2019-09-16","Author":"Charlie Schneider","Body":"Sure makes my life easier.","Heading":"Sure makes my life easier.","Rating":5,"Location":"GB"}
{"Date":"2019-05-07","Author":"al","Body":"Theu blocked me i dont know why!!and they dont answer me...","Heading":"Theu blocked me i dont know why!!and…","Rating":1,"Location":"IT"}
{"Date":"2020-05-05","Author":"Musa Fuyana","Body":"It is great but when i went to settings it couldn't let go back to whatsapp home screen i even tried to clear the app's user data fix pls","Heading":"It is great but when i went to settings…","Rating":3,"Location":"ZA"}
{"Date":"2023-07-16","Author":"Ashfaq Ahmad","Body":"The company has developed a good software but there are some weaknesses that can be fixed to make it even better.","Heading":"Whatsapp today is the only medium through which you can talk and see your loved ones anywhere in the world.","Rating":4,"Location":"PK"}
{"Date":"2022-11-29","Author":"Matthias Claes","Body":"Worst customer service I have ever experienced.\n\nI literally only got the same pre-made response to an issue with logging into a WhatsApp account. Trying to troubleshoot became impossible due to having to wait hours between attempts and when I asked to talked to a human, it's been radio silence.\n\nWe cannot log into WhatsApp for my girlfriend and it's the only way of communicating with her parents abroad without costing a lot of money.\n\nThis is shameful for such a big company.","Heading":"Worst customer service imaginable","Rating":1,"Location":"BE"}
{"Date":"2021-08-15","Author":"Piya Thissa","Body":"Whats app is one my everyday use app...new update is exellent ! This is the best app","Heading":"Best communication app😎","Rating":5,"Location":"LK"}
{"Date":"2019-05-26","Author":"George Butler","Body":"better apps for calling and massaging. I'm looking for better one for sharing buck files","Heading":"better apps for calling and massaging","Rating":3,"Location":"US"}
{"Date":"2023-03-23","Author":"maria zakkar","Body":"WhatsApp is one of my all time favorite messenger application. I even using on my laptop using WhatsApp Web feature and it works completely well. And I mostly like about it is its calling features, and video calling as well.","Heading":"WhatsApp is lifeline to see family","Rating":5,"Location":"DK"}
{"Date":"2023-01-19","Author":"Bill Levinson","Body":"Most worthless app I have ever seen. It asks you to scan a bar code on a phone, which assumes everybody has a phone of this capability which I do not. If you are trying to set up some kind of discussion, a lot of your stakeholders will not be able to use this. I had to tell a friend who is trying to set up a discussion group with this that the app is worthless and unusable. If you try to get help, it tells you to use your phone settings (HOW????) to do so, although I managed to send a message via their web site.","Heading":"Most worthless app I have ever seen","Rating":1,"Location":"US"}
{"Date":"2021-01-07","Author":"Irene Zendie","Body":"It would be cool to record a voice note to status instead of just writing.","Heading":"voice note on status…","Rating":3,"Location":"NA"}
{"Date":"2021-09-04","Author":"Blue Dot","Body":"Almost every feature is good but group member limit of 250 is pathetic and annoying.","Heading":"Almost every feature is good but group…","Rating":3,"Location":"PK"}
{"Date":"2019-07-20","Author":"Mark Blaxland","Body":"I've used WhatsApp for years and marveled how easy it was to exchange data. I recently, a few days ago received a video from a friend. I watched the video for a few days. Then I received an option to join a new album feature proporting to be sent from the friend that sent the video. Being late at night I didn't contact him, thinking it was a bit strange receiving this and it was legit. So I okd it. Since then can't play the video. It's important for the music I play to be able to veiw this video. But since this service I can't veiw it. I don't want this service. Its been forced on me with no choice. Whatsgoingon WhatsApp. I'm fuming. I'd like to know why I have to have it when I don't want it and then why delete my video. When I entrust my data to you I expect to be able to access it. Please reply sensibly without silly 😋 faces because I'm feeling very raw at the moment. Hope you have better customer services than 3 mobile mark blaxland.","Heading":"I've used WhatsApp for years whatsupp now","Rating":2,"Location":"GB"}
{"Date":"2024-04-05","Author":"Consumer","Body":"I had to delete the App and reload to save memory on my phone. Which I’ve done before, then logged back in. This time I can’t get back in. Customer support via email is terrible as I just get automated messages with which I get nowhere and there is no proper way to get real support when a problem does arise. I really liked using WhatsApp, but now I can’t even get into it!!","Heading":"No technical support, terrible support via email. In fact no support anywhere!!","Rating":1,"Location":"GB"}
{"Date":"2019-01-12","Author":"Inoussa Nsangou","Body":"WatsApp is awesome but I want to be able to connect more than 3 people in one WatsApp call. It only allows three participants. We want to be able to make a group call of at least 5 people in one call. Please let's know if this is possible.","Heading":"WatsApp is awesome but I want to be…","Rating":4,"Location":"CA"}
{"Date":"2024-05-08","Author":"customer","Body":"With the new WhatsApp Business update, the archive button, which appears when you drag it down, is gone.\n\nI don't have access to my archived messages.\n\nIn the configuration part, you can even find the option to archive all messages, not retrieve them.","Heading":"Archived button is gone!","Rating":2,"Location":"GB"}
{"Date":"2024-03-24","Author":"Jerry Jocoy","Body":"Well they're letting the little monkey Nigerians use WhatsApp now so they're always acting like some supermodel messaging you and trying to hack your internet steal money from you, and I just wish they would kick those little useless dirty monkeys off of here! Or at least when you report them they would cancel that account out of the little dirty Nigerian monkeys.","Heading":"Beware of Nigerian monkeys","Rating":1,"Location":"US"}
{"Date":"2022-12-26","Author":"Harkeerat Singh","Body":"I’m trying to transfer my WhatsApp chats from iPhone to android and WhatsApp don’t provide any tools to help with this, even the third party softwares cost alot of money. Why should the customers have to put up with this? It’s like they are making it hard on purpose","Heading":"Company doesn’t care about customers","Rating":1,"Location":"GB"}
{"Date":"2020-07-14","Author":"Dan Gruziwsko","Body":"they pay to tele companies that people can use it for free even with expire mobile data, this is not following simple rules of internet be neutral, i hope that at least in EU it's will be soon not allowed...","Heading":"they pay to tele companies that people…","Rating":1,"Location":"US"}
{"Date":"2019-11-21","Author":"Rogelio Hernsndez","Body":"Iv met a lot of people  here not one...not one..was the person in their pics.it seems every scammer in the wotld lives here.everyone asks for money.usally going to nigeria or somewhere in africa.","Heading":"Iv met a lot of people  here not…","Rating":1,"Location":"US"}
{"Date":"2023-09-28","Author":"Paul Andersen","Body":"i had my account hacked and WhatsApp don't want to help me sort it out","Heading":"i had my account hacked","Rating":1,"Location":"GB"}
{"Date":"2018-11-22","Author":"Curtis Eden","Body":"Whats App is not a secured social app. So many information getting leaked easily by whats app. It says encrypted but actually losing our private information. I hope they increase the security level.","Heading":"Whats App is not a secured social app","Rating":2,"Location":"US"}
{"Date":"2023-07-13","Author":"Fok Yuu Brave","Body":"Horrible Windows App, since switch to the Windows App Store. Regularly crashes, apparently due to a memory leak or death loop. Videos often send as gif, without sound, without and prior notification of this. \n\nAlso their \"Support\" is non existent - and I have tried to contact them on at least 4 occasions. Every time they did absolutely nothing to solve the issue at hand. They put up a facade of a person and wasted my time by replying like a literal bot (which it very likely is - at least invest in some chat gpt bot, Jesus). And any information I included in my message was completely ignored.","Heading":"Horrible Windows App","Rating":1,"Location":"DE"}
{"Date":"2018-11-21","Author":"Tony Williams","Body":"There really is nothing that makes WhatsApp stand out from other communication platforms like Messenger. The app uses alot of data and isnt that light on the phone.","Heading":"Nothing new...","Rating":3,"Location":"US"}
{"Date":"2020-03-12","Author":"Sunil Bhowmik","Body":"Thanks so much for your help and support.very good and awsome it.I always use and support it.","Heading":"Thanks so much for your help and…your help","Rating":5,"Location":"IN"}
{"Date":"2023-09-21","Author":"Khushbakht Tahir","Body":"best app and easy to use","Heading":"best app and easy to use","Rating":4,"Location":"PK"}
{"Date":"2022-10-14","Author":"Ronna","Body":"There is nothing but scam artists on this web site beware and do not trust","Heading":"There is nothing but scam artists on…","Rating":1,"Location":"US"}
{"Date":"2017-08-31","Author":"Nicholas","Body":"i love it, the transition from phone to pc is exceptional and it affords me the chance to focus on one device without getting distracted much","Heading":"i love it","Rating":5,"Location":"NG"}
{"Date":"2020-06-19","Author":"Rutva Jani","Body":"Please add the function of asking the permission for adding anyone on voice\/video call. This creates inconvenience due to addition of any unexpected person accidentally. Please see to it.","Heading":"Please add the function of asking the…","Rating":3,"Location":"IN"}
{"Date":"2021-01-13","Author":"Rebecca Holien","Body":"Horrible site.... and have been a victum of scam profiles. Men contact you with fake photos and then ask for money or gift cards. I have even had a man try and blackmail me. DO NOT BE A VICTUM!!!!! DO NOT USE THIS SITE EVER TO MEET MEN... ESPECIALLY IF YOU ARE LOOKING FOR A RELATIONSHIP!!!!!! RATE IT AN ABSOLUTE SCAM APP!!!!!","Heading":"Horrible site...","Rating":1,"Location":"US"}
{"Date":"2022-02-13","Author":"Doug Minde","Body":"Lots of negative reviews on here. Well I was thinking of getting it but it doesn't look particularly secure to me. Just a bit more social media stuff that nobody really needs? But I'll give it two stars as I haven't actually used it.","Heading":"Mmmm..","Rating":2,"Location":"GB"}
{"Date":"2023-09-29","Author":"Francesco","Body":"4 months now im having an issue with duplicate images, did everything that whatsapp suggested but nothing fixed it!\nall the setting are disabled as they asked but nothing changed 200 and more pictures getting downloaded on other phones is not happening.\n4 months no one is looking to why this is happening, they are asking for a screen recording, provided multiple screenshot and logs as they requested but still nothing.","Heading":"issue with duplicate images","Rating":1,"Location":"CH"}
{"Date":"2020-04-23","Author":"Abhinav Pandey","Body":"Used to be a great service but not anymore.\n\nA non existent customer support and slow speed when it supposed to fast. It takes so much mobile data when sending texts only that I suspect it is stealing data.\n\nWould not recommend.","Heading":"Used to be a great service but not…","Rating":2,"Location":"IN"}
{"Date":"2023-07-05","Author":"David","Body":"I have used Whatsapp for many years with no issues until recently. I have an android phone which always used to backup WA to GoogleDrive. However GoogleDrive now gives an error message of 'access blocked authorisation error. This app does not comply with Google's secure browser policy'. I have no idea what it means or why it has happened but I sent it to WA technical and they were hopeless","Heading":"hopeless technical assistance","Rating":1,"Location":"GB"}
{"Date":"2024-03-12","Author":"michael lashun","Body":"the download speed on whats app is disappointing, often leading to frustrating interruptions mid-download.","Heading":"the download speed on whats app is…","Rating":2,"Location":"US"}
{"Date":"2020-03-12","Author":"Tony Stark","Body":"Excellent messaging app.... Being used so widely all over the world..... Must use and download","Heading":"Excellent messaging app...","Rating":5,"Location":"IN"}
{"Date":"2022-06-13","Author":"Sara J","Body":"Why has whatapps app changed so that customers with older phones are unable to use it?  In a time when we should all be playing out part in reducing our waste and with the cost of basic living  rising so  dramatically. \nMy elderly father has a iphone thats been givem to him, which he cannot use to contact his family on through WhatsApp now!  Also what reasoning is there for  WhatsApp to decided to isolate their customers  many who are vulnerable and cannot afford a new phone to use this service. Can someone explain to me why this has been done this?","Heading":"Why has whatapps app changed so that…","Rating":1,"Location":"GB"}
{"Date":"2021-08-29","Author":"Cattus","Body":"I use this to do calls, but in the call i get disconnected. When i use Whatsapp on computer, when i click \"Call\" it says \"Microphone not found\".","Heading":"Don't works","Rating":2,"Location":"IT"}
{"Date":"2019-03-10","Author":"festus junias","Body":"whatsapp is one of the best apps mankind could have ever got. the fact that you can communicate worldwide is simply enough.","Heading":"whatsapp is one of the best apps…","Rating":5,"Location":"NA"}
{"Date":"2023-08-11","Author":"Ajaz Ahmad Tantray","Body":"This is a amazing app I like this","Heading":"This is a amazing app I like this","Rating":5,"Location":"IN"}
{"Date":"2024-05-03","Author":"Haz C","Body":"I have attempted to no avail to change my language option in the WhatsApp app from English (US) to English (UK). I am native English in the UK and speak UK English, not US English. WhatsApp are unlawfully discriminating against the English. ","Heading":"WhatsApp's Unlawful Race Discrimination","Rating":1,"Location":"GB"}
{"Date":"2020-05-18","Author":"Ana Oror","Body":"Love the security encryption","Heading":"Love the security encryption","Rating":5,"Location":"GB"}
{"Date":"2023-10-20","Author":"Michael In Paris","Body":"I connected to WhatsApp Web on my PC. Right after I linked it with my smartphone, it briefly displayed a list of all my conversations, and a few seconds later only those that were not archived, the archived ones being accessible by a button which appeared too. But in the non-archived ones a conversation with a group I had just joined was missing, although it had been initially displayed in the list of all conversations. So in WhatsApp Web, it is inaccessible, while it is in WhatsApp Desktop.\nAll my reports to their \"support\" (including a video shot of the process) were replied to by irrelevant messages.","Heading":"WhatsApp Web doesn't display all conversations","Rating":1,"Location":"FR"}
{"Date":"2021-02-25","Author":"Jesse Greif","Body":"A great platform to connect with people that has been turned to a funnel for sending sensitive data to Facebook. An absolute travesty, the new T&Cs.\n\nI for one have since migrated to Signal and Telegram.","Heading":"TERRIBLE TERMS & CONDITIONS","Rating":1,"Location":"US"}
{"Date":"2020-04-28","Author":"Nate M.","Body":"WhatsApp is great. The absolute most effective messenger","Heading":"WhatsApp is great","Rating":5,"Location":"US"}
