{"Date":"2022-09-30","Author":"Isabelle","Body":"I can't transfer my old chats without scanning a QR on my old phone. Problem is the camera of my old phone doesn't work and the only answer I got from their support was one by a chatbot that didn't respond to my actual problem. So please if there is any other way of transferring my chats without having to scan this QR code I'd be happy to hear from signal by a real person.","Heading":"only a chatbot for support is not even close to enough","Rating":1,"Location":"DE"}
{"Date":"2022-05-26","Author":"David","Body":"The most secure instant messenger in the world. Recommended! :)","Heading":"The most secure instant messenger in the world. Recommended! :)","Rating":5,"Location":"GB"}
{"Date":"2023-08-05","Author":"Sugarcube","Body":"Signal has now become my favorite encrypted messaging app for its simplicity and directness without all the annoying, over-the-top, and ultimately futile features that other encrypted messaging apps (e.g., Telegram and WhatsApp) has.\n\nEven though I only communicate with three people on the app, I grew fond of their service and have started donating whenever I can.","Heading":"One of the best alternatives to Telegram, especially for those that dislike Telegram.","Rating":5,"Location":"US"}
{"Date":"2020-08-16","Author":"Sungdarong","Body":"Great app with the strongest security for its users","Heading":"Great app with the strongest security…","Rating":5,"Location":"US"}
{"Date":"2022-02-10","Author":"Marius B","Body":"Having an open source code which was audited already by multiple entities and professional people that work in this domain gives you the security that a message delivered will be read by the person intended only.","Heading":"The best option to securely chat with everyone.","Rating":5,"Location":"GB"}
{"Date":"2023-07-23","Author":"Will Hoskings","Body":"Cool app!  I regularly use it to talk to my friends.\nPersonally, I'd much prefer it over Discord, Teams, et. al. as it's much more secure with its end-to-end encryption.\n\nI'll deduct a point for no GIFs on desktop though.  It's been an issue for what... 5 years now, and it's still missing.  My friend is constantly complaining about it, pointing out that GIF support is present on mobile.  I do agree: why hasn't it been implemented already?\n\n(P.S. regarding my quasi feature request: I'm a Signal supporter, which means I give £5\/mo to support their cause.  I believe this gives me some grounds to ask for features without being entitled.)","Heading":"Cool app","Rating":4,"Location":"GB"}
{"Date":"2022-01-25","Author":"KataTonNik ","Body":"This is the email I had with signal customer support : \n\nme - I can't increase the volume, it's very low. \n\nSignal -  What happens when you try to use the volume buttons on your phone? What text, images, or behavior do you see on your screen? Is this for voice messages or during audio or video calls?\n\nme - No, the messages sound is fine. It's the ringing for voice calls and video calls. The sound is extremely low.\n\nsignal - Got it. Is your overall phone volume adjusted high enough before these calls come in?\n\nme - Yes everything is as high as it can go.\n\nsignal - Does this happen with every single contact you call?\n\nme - It's not when I call,it's when they call me, that's when the phone rings right? Your phone doesn't ring when you call others, it rings when others try to call you, since the first phone was invented ...right? Are you sure you are signal support ?","Heading":"This is the email I had with signal…","Rating":1,"Location":"GB"}
{"Date":"2021-05-09","Author":"Chetan Bhasin","Body":"It's got some catching up to do, but I'm already very, very happy with the service.\nCross-platform application with audio+video call support, the open source software with strong end-to-end encryption and Signal protocol, and surprisingly good audio\/video call quality for a company that runs on donations.\n\nThe UX could be better, but a designer could tell that it's built for accessibility and not for aesthetics. That doesn't mean the UI couldn't be more pleasing. Signal is still my preferred app, and will remain so, but I hope they keep improving the UI alongside other features.\n\nWhile Signal still has ways to go, I'm very confident in their ability to build on top of their already excellent product.\nHaving said that, I'd appreciate an Apple Watch app though. :D","Heading":"Going Strong","Rating":5,"Location":"DE"}
{"Date":"2021-02-16","Author":"Muzammil","Body":"Feature parity with Telegram on the Android and Windows app will be welcome.","Heading":"Feature parity with Telegram will be welcome","Rating":5,"Location":"AE"}
{"Date":"2023-09-21","Author":"Ilya","Body":"Works ok, but every freaking time I open it on my laptop, it asks for an update, very annoying.","Heading":"Works ok","Rating":3,"Location":"DE"}
{"Date":"2023-06-28","Author":"MS","Body":"Switched to it because MMS support is dropping but when i discovered Apple Live Photo is not supported and posted in the so called community forum my post got removed 2 times for no apparent reason except that i expressed i want that feature. Also mentioned why this feature is important. \n\nNot sure what shady stuff is going on there but certainly annoying AF. Feels like somebody is not a fan of Apple or something like that.\n\nEDIT: \nNow my 3rd attempt to post in their community forum got also deleted it was the following: \n\n\"Pleas make this work normally like WhatsApp can do it. People switch to Signal because MMS is getting stopped but then discover you can't send picture with full support is not good.\" Deleted by Admin because its inappropriate. Logic much?\n\nTurns out a certain \"Herohtar\" keeps deleting my posts. Apparently \"i got nothing new to say\" ... aehm well - thats like your opinion friend. Imho he seems to work against the best interests of Signal but opinions may differ ;-)","Heading":"Switched to it because MMS support is…","Rating":2,"Location":"CH"}
{"Date":"2021-02-07","Author":"Lahiru Madushan","Body":"Best site & Apps 💛💛💛💙💙💙💚💚💚","Heading":"Best site & Apps 💛💛💛💙💙💙💚💚💚","Rating":5,"Location":"LK"}
{"Date":"2023-09-29","Author":"Vira Snowden","Body":"The groups dimension to this app facilitates child porn and the Signal Foundation obviously knows that. There are groups that overtly call themselves  'CP...', 'Children' etc., and  the group administrators and others post child porn videos and images on there openly. That is outrageous and there is no way the Signal Foundation could not know this is going on. This SIGNAL app should be banned. If Trustpilot wants to see the evidence I have it. Why hasn't INTERPOL done something about this app?","Heading":"Child Porn videos openly posted in the Signal groups.","Rating":1,"Location":"NZ"}
{"Date":"2024-01-16","Author":"Chander Whitmire","Body":"I have successfully converted a lot of friends and family from Whatsapp to Signal and I couldn't be happier. Signal is easy, private, free. It has only the features you need and no garbage fluff. My only problem with it is the requiring a phone number. If it wasn't for that, it'd be a full 5 stars.","Heading":"I have successfully converted a lot of…","Rating":4,"Location":"GB"}
{"Date":"2023-12-22","Author":"TrustPilot user","Body":"Stopped trusting them when they implemented shady, untrusted shitcoin MobiCoin as a sole payment method in the app, to send transactions between users, which doesn't work properly to this day, and MobiCoin cannot be bought anywhere. How can you transfer something if you can't obtain it in the first place? They could have just implemented Bitcoin Lightning payments instead. Bitcoin is most trustworthy currency in the world, but no, they had to design their own shitcoin instead. Uninstalled their app, can't trust greedy CEO and managers.","Heading":"Stopped trusting them when they…","Rating":1,"Location":"GB"}
{"Date":"2021-01-24","Author":"Mo Best","Body":"Good app and good Telegram alternative if it goes banned even i don’t believe this will happen.","Heading":"Good app and good Telegram alternative…","Rating":4,"Location":"NL"}
{"Date":"2024-01-28","Author":"JB","Body":"when you forget your password it’s supershit. There’s no way out of it.","Heading":"when you forget your password it’s…","Rating":1,"Location":"NL"}
